       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID.  CIBQ503.                                                    
       ENVIRONMENT DIVISION.                                                    
       INPUT-OUTPUT SECTION.                                                    
       FILE-CONTROL.                                                            
           SELECT INPUT-FILE ASSIGN TO UT-S-INPUT.                              
       DATA DIVISION.                                                           
       FILE SECTION.                                                            
       FD  INPUT-FILE                                                           
           BLOCK CONTAINS 0 RECORDS                                             
           LABEL RECORDS ARE STANDARD                                           
           DATA RECORD IS INPUT-RECORD.                                         
       01  INPUT-RECORD.                                                        
           03  LOW-IN             PIC S9(9) .                                   
           03  HIGH-IN            PIC S9(9).                                    
           03  FILLER             PIC X(62).                                    
       WORKING-STORAGE SECTION.                                                 
           EXEC SQL INCLUDE SQLCA END-EXEC.                                     
       77  RET1                   PIC S9(9) COMP.                               
       77  RET2                   PIC S9(9) COMP.                               
       77  RET3                   PIC S9(9) COMP.                               
       77  SQLVALUE               PIC S9(9) COMP.                               
       77  LOWNUM                 PIC S9(9) COMP.                               
       77  FETCH-COUNT            PIC S9(9) COMP.                               
       77  HIGHNUM                PIC S9(9) COMP.                               
       77  EOF-FLAG               PIC X(3) VALUE 'NO'.                          
       PROCEDURE DIVISION.                                                      
           OPEN INPUT INPUT-FILE.                                               
           READ INPUT-FILE AT END MOVE 'YES' TO EOF-FLAG.                       
           PERFORM SQL-CALL.                                                    
           CLOSE INPUT-FILE.                                                    
      *                                                                         
      *                                                                         
           GOBACK.                                                              
       SQL-CALL.                                                                
           MOVE LOW-IN  TO LOWNUM.                                              
           MOVE HIGH-IN TO HIGHNUM.                                             
           EXEC SQL DECLARE TESTCURS CURSOR FOR                                 
                SELECT K2, K100 FROM DAVID.SQ1                                  
                WHERE KSEQ BETWEEN :LOWNUM AND :HIGHNUM                         
                ORDER BY K2, K100                                               
                END-EXEC.                                                       
           EXEC SQL OPEN TESTCURS END-EXEC.                                     
      *    DISPLAY 'TRAP1', SQLCODE, SQLCA.                                     
           MOVE 0 TO FETCH-COUNT.                                               
           PERFORM FETCHIT UNTIL SQLCODE NOT = 0 OR FETCH-COUNT > 100.          
      *    DISPLAY 'TRAP2', SQLCODE, SQLCA.                                     
           EXEC SQL                                                             
                CLOSE TESTCURS                                                  
                END-EXEC.                                                       
       FETCHIT.                                                                 
           EXEC SQL                                                             
                FETCH TESTCURS INTO :RET1, :RET2                                
                END-EXEC.                                                       
                ADD 1 TO FETCH-COUNT.                                           
      *    DISPLAY 'TRAP3', SQLCODE, SQLCA.                                     
