//INITSSS     JOB (X),DYOUNG,MSGCLASS=X,PRTY=13                         00000003
//STEP1       EXEC PGM=ICKDSF,REGION=4096K                              00000080
//SYSPRINT    DD SYSOUT=*                                               00000090
//SYSUDUMP    DD SYSOUT=*                                               00000090
//SYSIN       DD *                                                      00000100
 INIT UNIT(8DE) NVFY NCHK VTOC(0,1,14) VOLID(SMS9EA) -                  00000110
 STORAGEGROUP INDEX(2,11,5)                                                     
