//DB2SMF6C JOB (330DJY00),'D J YOUNG ',MSGCLASS=Q,NOTIFY=DAVID          00001008
//COB2UCL PROC                                                          00010000
//*   PROC FOR COBOL II - COMPILE AND LINK                              00020000
//COB2 EXEC PGM=IGYCRCTL,PARM='OBJECT,LIB,APOST,LIST',REGION=1024K      00030002
//*TEPLIB DD DSNAME=DB2IMS.COB2COMP,DISP=SHR,UNIT=3390,VOL=SER=DB2IMS   00040005
//STEPLIB  DD  DSNAME=SYS1.COB2COMP,DISP=SHR,VOL=SER=MV4RSA,UNIT=3390   00040005
//SYSPRINT DD  SYSOUT=*                                                 00050000
//SYSLIN   DD  DSNAME=&&LOADSET,UNIT=3390,DISP=(MOD,PASS),              00060000
//             SPACE=(TRK,(3,3))                                        00070000
//SYSUT1   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00080000
//SYSUT2   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00090000
//SYSUT3   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00100000
//SYSUT4   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00110000
//SYSUT5   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00120000
//SYSUT6   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00121000
//SYSUT7   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00122000
//LKED   EXEC  PGM=IEWL,PARM='LIST,XREF,',COND=(5,LT,COB2),             00130003
//             REGION=512K                                              00140003
//SYSLIN   DD  DSNAME=&&LOADSET,DISP=(OLD,DELETE)                       00150003
//*YSLMOD  DD  DSNAME=DAVID.DB2SMF.PGMLIB(DB2SMF6),                     00170005
//*            DISP=SHR                                                 00180003
//SYSLMOD  DD  DSNAME=SYS1.DSN230.DSNLINK(DB2SMF6),                     00170005
//             DISP=SHR                                                 00180003
//SYSLIB DD  DSNAME=SYS1.COB2LIB,DISP=SHR,UNIT=3390,VOL=SER=MV4RSA      00190005
//       DD  DSNAME=DAVID.DB2SMF.SRCLIB,DISP=SHR,UNIT=3390,             00190005
//       VOL=SER=DB2IMS                                                 00200003
//SYSUT1   DD  UNIT=3390,SPACE=(CYL,(1,1))                              00200003
//SYSPRINT DD  SYSOUT=*                                                 00210003
// PEND                                                                 00220000
//DOIT EXEC COB2UCL                                                     00230000
//SYSIN DD *                                                            00240010
       ID DIVISION.                                                             
       PROGRAM-ID. DB2SMF6.                                                     
       AUTHOR. D J YOUNG.                                                       
       ENVIRONMENT DIVISION.                                                    
       INPUT-OUTPUT SECTION.                                                    
       FILE-CONTROL.                                                            
           SELECT INPUT-FILE ASSIGN TO UT-S-DB2SMF.                             
           SELECT OUTPUT-FILE ASSIGN TO UT-S-OUTPUT.                            
           SELECT CONTROL-FILE ASSIGN TO UT-S-CONTROL.                          
       DATA DIVISION.                                                           
       FILE SECTION.                                                            
       FD  OUTPUT-FILE                                                          
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS 121 CHARACTERS                                       
           RECORDING MODE F                                                     
           LABEL RECORDS ARE STANDARD.                                          
       01  OUTPUT-RECORD        PIC X(121).                                     
       FD  INPUT-FILE                                                           
           BLOCK CONTAINS 32760 CHARACTERS                                      
           RECORD IS VARYING FROM 4 TO 32752 CHARACTERS                         
           RECORDING MODE V                                                     
           LABEL RECORDS ARE STANDARD.                                          
       01  INPUT-RECORD         PIC X(32752).                                   
       FD  CONTROL-FILE                                                         
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS 80 CHARACTERS                                        
           RECORDING MODE F                                                     
           LABEL RECORDS ARE STANDARD.                                          
       01  CONTROL-RECORD.                                                      
           05  PLAN-IN          PIC X(12).                                      
           05  FILLER           PIC X(68).                                      
       WORKING-STORAGE SECTION.                                                 
       77  ABEND-CODE           PIC S9(4) COMP.                                 
       77  TIMER-CONSTANT       PIC S9(10) COMP VALUE +4096000000.              
       77  EOF-FLAG             PIC X(3) VALUE 'NO'.                            
       77  SMF-FLAG             PIC X(8) VALUE SPACES.                          
       77  CONTROL-FLAG         PIC X(3) VALUE 'NO'.                            
       77  SEARCH-FLAG          PIC X(3) VALUE 'NO'.                            
       77  S-SUB                PIC S9(9) COMP.                                 
       77  S-SUB-SAVE           PIC S9(9) COMP.                                 
       01  TRAN-WORK.                                                           
           03  APPL-ELAPSED-WORK    PIC S9(9)V9999.                             
           03  APPL-TCB-WORK        PIC S9(9)V9999.                             
           03  APPL-SRB-WORK        PIC S9(9)V9999.                             
           03  APPL-LOCKWAIT-WORK   PIC S9(9)V9999.                             
           03  APPL-IOWAIT-WORK     PIC S9(9)V9999.                             
       01  TRAN-LOCATE.                                                         
           03  NUM-PLANS        PIC S9(9) COMP.                                 
           03  PLANS OCCURS 1 TO 100 TIMES DEPENDING ON NUM-PLANS               
               INDEXED BY PLAN-INDEX.                                           
               05  PLAN-NAME    PIC X(12).                                      
               05  PLAN-NUM     PIC 9(3).                                       
       01  TRAN-SUMMARY.                                                        
           02  NUM-TRANS        PIC S9(9) COMP VALUE 0.                         
           02  TRANS OCCURS 1 TO 100 TIMES DEPENDING ON NUM-TRANS.              
               03  TRAN-TIMES.                                                  
                   05  PLAN-OUT     PIC X(12).                                  
                   05  NUMT PIC S9(18) COMP.                                    
                   05  ELAPSED      PIC S9(9)V9999.                             
                   05  TCB          PIC S9(9)V9999.                             
                   05  SRB          PIC S9(9)V9999.                             
                   05  LOCKWAIT     PIC S9(9)V9999.                             
                   05  IOWAIT       PIC S9(9)V9999.                             
               03  AWACTRAN.                                                    
                   05  WACN1       PIC S9(18) COMP.                             
                   05  WACN2       PIC S9(18) COMP.                             
                   05  WACN3       PIC S9(18) COMP.                             
                   05  WACN4       PIC S9(18) COMP.                             
                   05  WACN5       PIC S9(18) COMP.                             
                   05  WACN6       PIC S9(18) COMP.                             
                   05  WACN7       PIC S9(18) COMP.                             
               03  AXSTTRAN.                                                    
                   05  XSTN1       PIC S9(18) COMP.                             
                   05  XSTN2       PIC S9(18) COMP.                             
                   05  XSTN3       PIC S9(18) COMP.                             
                   05  XSTN4       PIC S9(18) COMP.                             
                   05  XSTN5       PIC S9(18) COMP.                             
                   05  XSTN6       PIC S9(18) COMP.                             
                   05  XSTN7       PIC S9(18) COMP.                             
                   05  XSTN8       PIC S9(18) COMP.                             
                   05  XSTN9       PIC S9(18) COMP.                             
                   05  XSTN10      PIC S9(18) COMP.                             
                   05  XSTN11      PIC S9(18) COMP.                             
                   05  XSTN12      PIC S9(18) COMP.                             
                   05  XSTN13      PIC S9(18) COMP.                             
                   05  XSTN14      PIC S9(18) COMP.                             
                   05  XSTN15      PIC S9(18) COMP.                             
                   05  XSTN16      PIC S9(18) COMP.                             
                   05  XSTN17      PIC S9(18) COMP.                             
                   05  XSTN18      PIC S9(18) COMP.                             
                   05  XSTN19      PIC S9(18) COMP.                             
                   05  XSTN20      PIC S9(18) COMP.                             
                   05  XSTN21      PIC S9(18) COMP.                             
                   05  XSTN22      PIC S9(18) COMP.                             
                   05  XSTN23      PIC S9(18) COMP.                             
                   05  XSTN24      PIC S9(18) COMP.                             
                   05  XSTN25      PIC S9(18) COMP.                             
                   05  XSTN26      PIC S9(18) COMP.                             
                   05  XSTN27      PIC S9(18) COMP.                             
                   05  XSTN28      PIC S9(18) COMP.                             
                   05  XSTN29      PIC S9(18) COMP.                             
                   05  XSTN30      PIC S9(18) COMP.                             
                   05  XSTN31      PIC S9(18) COMP.                             
                   05  XSTN32      PIC S9(18) COMP.                             
                   05  XSTN33      PIC S9(18) COMP.                             
                   05  XSTN34      PIC S9(18) COMP.                             
               03  ABACTRAN.                                                    
                   05  BAC1N1      PIC S9(18) COMP.                             
                   05  BAC1N2      PIC S9(18) COMP.                             
                   05  BAC1N3      PIC S9(18) COMP.                             
                   05  BAC1N4      PIC S9(18) COMP.                             
                   05  BAC1N5      PIC S9(18) COMP.                             
                   05  BAC1N6      PIC S9(18) COMP.                             
                   05  BAC1N7      PIC S9(18) COMP.                             
                   05  BAC1N8      PIC S9(18) COMP.                             
                   05  BAC2N1      PIC S9(18) COMP.                             
                   05  BAC2N2      PIC S9(18) COMP.                             
                   05  BAC2N3      PIC S9(18) COMP.                             
                   05  BAC2N4      PIC S9(18) COMP.                             
                   05  BAC2N5      PIC S9(18) COMP.                             
                   05  BAC2N6      PIC S9(18) COMP.                             
                   05  BAC2N7      PIC S9(18) COMP.                             
                   05  BAC2N8      PIC S9(18) COMP.                             
                   05  BAC3N1      PIC S9(18) COMP.                             
                   05  BAC3N2      PIC S9(18) COMP.                             
                   05  BAC3N3      PIC S9(18) COMP.                             
                   05  BAC3N4      PIC S9(18) COMP.                             
                   05  BAC3N5      PIC S9(18) COMP.                             
                   05  BAC3N6      PIC S9(18) COMP.                             
                   05  BAC3N7      PIC S9(18) COMP.                             
                   05  BAC3N8      PIC S9(18) COMP.                             
                   05  BAC4N1      PIC S9(18) COMP.                             
                   05  BAC4N2      PIC S9(18) COMP.                             
                   05  BAC4N3      PIC S9(18) COMP.                             
                   05  BAC4N4      PIC S9(18) COMP.                             
                   05  BAC4N5      PIC S9(18) COMP.                             
                   05  BAC4N6      PIC S9(18) COMP.                             
                   05  BAC4N7      PIC S9(18) COMP.                             
                   05  BAC4N8      PIC S9(18) COMP.                             
               03  ATXATRAN.                                                    
                   05  TXAN1       PIC S9(18) COMP.                             
                   05  TXAN2       PIC S9(18) COMP.                             
                   05  TXAN3       PIC S9(18) COMP.                             
                   05  TXAN4       PIC S9(18) COMP.                             
                   05  TXAN5       PIC S9(18) COMP.                             
                   05  TXAN6       PIC S9(18) COMP.                             
                   05  TXAN7       PIC X(2).                                    
                   05  TXAN9       PIC X(2).                                    
                   05  TXAN10      PIC S9(18) COMP.                             
                   05  TXAN11      PIC S9(18) COMP.                             
                   05  TXAN12      PIC S9(18) COMP.                             
                   05  TXAN13      PIC S9(18) COMP.                             
                   05  TXAN14      PIC S9(18) COMP.                             
                   05  TXAN15      PIC S9(18) COMP.                             
                   05  TXAN16      PIC S9(18) COMP.                             
                   05  TXAN17      PIC S9(18) COMP.                             
                   05  TXAN18      PIC S9(18) COMP.                             
                   05  TXAN19      PIC S9(18) COMP.                             
                   05  TXAN20      PIC S9(18) COMP.                             
                                                                                
      *****************************************************************         
      * DATA AREA TO BE FILLED IN BY SYSSTATS SUBROUTINE                        
      *****************************************************************         
       01  SYSTEM-STATS-WORKAREA.                                               
           03  FILLER           PIC X(8) VALUE 'WORKAREA'.                      
           03  QWSA.                                                            
               05  QWSAPRC1     PIC X(4).                                       
               05  QWSATCB1     PIC S9(18) COMP.                                
               05  QWSASRB1     PIC S9(18) COMP.                                
               05  QWSAASN1     PIC S9(4) COMP.                                 
               05  QWSAPRC2     PIC X(4).                                       
               05  QWSATCB2     PIC S9(18) COMP.                                
               05  QWSASRB2     PIC S9(18) COMP.                                
               05  QWSAASN2     PIC S9(4) COMP.                                 
               05  QWSAPRC3     PIC X(4).                                       
               05  QWSATCB3     PIC S9(18) COMP.                                
               05  QWSASRB3     PIC S9(18) COMP.                                
               05  QWSAASN3     PIC S9(4) COMP.                                 
               05  FILLER       PIC S9(4) COMP.                                 
           03  Q3ST.                                                            
               05  Q3STN1       PIC S9(9) COMP.                                 
               05  Q3STN2       PIC S9(9) COMP.                                 
               05  Q3STN3       PIC S9(9) COMP.                                 
               05  Q3STN4       PIC S9(9) COMP.                                 
               05  Q3STN5       PIC S9(9) COMP.                                 
               05  Q3STN6       PIC S9(9) COMP.                                 
               05  Q3STN7       PIC S9(9) COMP.                                 
               05  Q3STN8       PIC S9(9) COMP.                                 
               05  Q3STN9       PIC S9(9) COMP.                                 
               05  Q3STN10      PIC S9(9) COMP.                                 
               05  Q3STN11      PIC S9(9) COMP.                                 
               05  Q3STN12      PIC S9(9) COMP.                                 
               05  Q3STN13      PIC S9(9) COMP.                                 
               05  Q3STN14      PIC S9(9) COMP.                                 
           03  Q9ST.                                                            
               05  Q9STN1       PIC S9(9) COMP.                                 
               05  Q9STN2       PIC S9(9) COMP.                                 
               05  Q9STN3       PIC S9(9) COMP.                                 
               05  Q9STN4       PIC S9(9) COMP.                                 
               05  Q9STN5       PIC S9(9) COMP.                                 
               05  Q9STN6       PIC S9(9) COMP.                                 
               05  Q9STN7       PIC S9(9) COMP.                                 
               05  Q9STN8       PIC S9(9) COMP.                                 
               05  Q9STN9       PIC S9(9) COMP.                                 
               05  Q9STN10      PIC S9(9) COMP.                                 
               05  Q9STN11      PIC S9(9) COMP.                                 
               05  Q9STN12      PIC S9(9) COMP.                                 
               05  Q9STN13      PIC S9(9) COMP.                                 
               05  Q9STN14      PIC S9(9) COMP.                                 
               05  Q9STN15      PIC S9(9) COMP.                                 
               05  Q9STN16      PIC S9(9) COMP.                                 
               05  Q9STN17      PIC S9(9) COMP.                                 
               05  Q9STN18      PIC S9(9) COMP.                                 
               05  Q9STN19      PIC S9(9) COMP.                                 
           03  QWSD.                                                            
               05  QWSDN1       PIC S9(9) COMP.                                 
               05  QWSDN2       PIC X(16).                                      
           03  QJST.                                                            
               05  QJSTN1       PIC S9(9) COMP.                                 
               05  QJSTN2       PIC S9(9) COMP.                                 
               05  QJSTN3       PIC S9(9) COMP.                                 
               05  QJSTN4       PIC S9(9) COMP.                                 
               05  QJSTN5       PIC S9(9) COMP.                                 
               05  QJSTN6       PIC S9(9) COMP.                                 
               05  QJSTN7       PIC S9(9) COMP.                                 
               05  QJSTN8       PIC S9(9) COMP.                                 
               05  QJSTN9       PIC S9(9) COMP.                                 
               05  QJSTN10      PIC S9(9) COMP.                                 
               05  QJSTN11      PIC S9(9) COMP.                                 
               05  QJSTN12      PIC S9(9) COMP.                                 
               05  QJSTN13      PIC S9(9) COMP.                                 
               05  QJSTN14      PIC S9(9) COMP.                                 
           03  SYSTEM-STATS-TIMESTAMP PIC S9(18) COMP.                          
           03  SYS-TIME-MOVE    PIC  9(7) COMP-3.                               
           03  SYS-DATE-MOVE    PIC  9(7) COMP-3.                               
           03  QVLS.                                                            
               05  QVLSN1       PIC S9(9) COMP.                                 
               05  QVLSN2       PIC S9(9) COMP.                                 
               05  QVLSN3       PIC S9(9) COMP.                                 
               05  QVLSN4       PIC S9(9) COMP.                                 
               05  QVLSN5       PIC S9(9) COMP.                                 
               05  QVLSN6       PIC S9(9) COMP.                                 
               05  QVLSN7       PIC S9(9) COMP.                                 
               05  QVLSN8       PIC S9(9) COMP.                                 
               05  QVLSN9       PIC S9(9) COMP.                                 
               05  QVLSN10      PIC S9(9) COMP.                                 
               05  QVLSN11      PIC S9(9) COMP.                                 
               05  QVLSN12      PIC S9(9) COMP.                                 
               05  QVLSN13      PIC S9(9) COMP.                                 
               05  QVLSN14      PIC S9(9) COMP.                                 
               05  QVLSN15      PIC S9(9) COMP.                                 
               05  QVLSN16      PIC S9(9) COMP.                                 
               05  QVLSN17      PIC S9(9) COMP.                                 
               05  QVLSN18      PIC S9(9) COMP.                                 
               05  QVLSN19      PIC S9(9) COMP.                                 
               05  QVLSN20      PIC S9(9) COMP.                                 
               05  QVLSN21      PIC S9(9) COMP.                                 
               05  QVLSN22      PIC S9(9) COMP.                                 
               05  QVLSN23      PIC S9(9) COMP.                                 
               05  QVLSN24      PIC S9(9) COMP.                                 
               05  QVLSN25      PIC S9(9) COMP.                                 
               05  QVLSN26      PIC S9(9) COMP.                                 
               05  QVLSN27      PIC S9(9) COMP.                                 
               05  QVLSN28      PIC S9(9) COMP.                                 
               05  QVLSN29      PIC S9(9) COMP.                                 
               05  QVLSN30      PIC S9(9) COMP.                                 
               05  QVLSN31      PIC S9(9) COMP.                                 
               05  QVLSN32      PIC S9(9) COMP.                                 
           03  QVAS.                                                            
               05  QVASN1       PIC S9(9) COMP.                                 
               05  QVASN2       PIC S9(9) COMP.                                 
               05  QVASN3       PIC S9(9) COMP.                                 
               05  QVASN4       PIC S9(9) COMP.                                 
               05  QVASN5       PIC S9(9) COMP.                                 
               05  QVASN6       PIC S9(9) COMP.                                 
               05  QVASN7       PIC S9(9) COMP.                                 
               05  QVASN8       PIC S9(9) COMP.                                 
               05  QVASN9       PIC S9(9) COMP.                                 
               05  QVASN10      PIC S9(9) COMP.                                 
      *****************************************************************         
      * DATA AREA TO BE FILLED IN BY DBTATS SUBROUTINE                          
      *****************************************************************         
       01  DB-STATS-WORKAREA.                                                   
           03  FILLER           PIC X(8) VALUE 'WORKAREA'.                      
           03  QXST.                                                            
               05  QXSTN1       PIC S9(9) COMP.                                 
               05  QXSTN2       PIC S9(9) COMP.                                 
               05  QXSTN3       PIC S9(9) COMP.                                 
               05  QXSTN4       PIC S9(9) COMP.                                 
               05  QXSTN5       PIC S9(9) COMP.                                 
               05  QXSTN6       PIC S9(9) COMP.                                 
               05  QXSTN7       PIC S9(9) COMP.                                 
               05  QXSTN8       PIC S9(9) COMP.                                 
               05  QXSTN9       PIC S9(9) COMP.                                 
               05  QXSTN10      PIC S9(9) COMP.                                 
               05  QXSTN11      PIC S9(9) COMP.                                 
               05  QXSTN12      PIC S9(9) COMP.                                 
               05  QXSTN13      PIC S9(9) COMP.                                 
               05  QXSTN14      PIC S9(9) COMP.                                 
               05  QXSTN15      PIC S9(9) COMP.                                 
               05  QXSTN16      PIC S9(9) COMP.                                 
               05  QXSTN17      PIC S9(9) COMP.                                 
               05  QXSTN18      PIC S9(9) COMP.                                 
               05  QXSTN19      PIC S9(9) COMP.                                 
               05  QXSTN20      PIC S9(9) COMP.                                 
               05  QXSTN21      PIC S9(9) COMP.                                 
               05  QXSTN22      PIC S9(9) COMP.                                 
               05  QXSTN23      PIC S9(9) COMP.                                 
               05  QXSTN24      PIC S9(9) COMP.                                 
               05  QXSTN25      PIC S9(9) COMP.                                 
               05  QXSTN26      PIC S9(9) COMP.                                 
               05  QXSTN27      PIC S9(9) COMP.                                 
               05  QXSTN28      PIC S9(9) COMP.                                 
               05  QXSTN29      PIC S9(9) COMP.                                 
               05  QXSTN30      PIC S9(9) COMP.                                 
               05  QXSTN31      PIC S9(9) COMP.                                 
               05  QXSTN32      PIC S9(9) COMP.                                 
               05  QXSTN33      PIC S9(9) COMP.                                 
               05  QXSTN34      PIC S9(9) COMP.                                 
           03  QTST.                                                            
               05  QTSTN1       PIC S9(9) COMP.                                 
               05  QTSTN2       PIC S9(9) COMP.                                 
               05  QTSTN3       PIC S9(9) COMP.                                 
               05  QTSTN4       PIC S9(9) COMP.                                 
               05  QTSTN5       PIC S9(9) COMP.                                 
               05  QTSTN6       PIC S9(9) COMP.                                 
               05  QTSTN7       PIC S9(9) COMP.                                 
               05  QTSTN8       PIC S9(9) COMP.                                 
               05  QTSTN9       PIC S9(9) COMP.                                 
               05  QTSTN10      PIC S9(9) COMP.                                 
               05  QTSTN11      PIC S9(9) COMP.                                 
               05  QTSTN12      PIC S9(9) COMP.                                 
               05  QTSTN13      PIC S9(9) COMP.                                 
               05  QTSTN14      PIC S9(9) COMP.                                 
               05  QTSTN15      PIC S9(9) COMP.                                 
               05  QTSTN16      PIC S9(9) COMP.                                 
               05  QTSTN17      PIC S9(9) COMP.                                 
               05  QTSTN18      PIC S9(9) COMP.                                 
               05  QTSTN19      PIC S9(9) COMP.                                 
           03  QBST1.                                                           
               05  QBST1N1      PIC S9(9) COMP VALUE -1.                        
               05  QBST1N2      PIC S9(9) COMP.                                 
               05  QBST1N3      PIC S9(9) COMP.                                 
               05  QBST1N4      PIC S9(9) COMP.                                 
               05  QBST1N5      PIC S9(9) COMP.                                 
               05  QBST1N6      PIC S9(9) COMP.                                 
               05  QBST1N7      PIC S9(9) COMP.                                 
               05  QBST1N8      PIC S9(9) COMP.                                 
               05  QBST1N9      PIC S9(9) COMP.                                 
               05  QBST1N10     PIC S9(9) COMP.                                 
               05  QBST1N11     PIC S9(9) COMP.                                 
               05  QBST1N12     PIC S9(9) COMP.                                 
               05  QBST1N13     PIC S9(9) COMP.                                 
               05  QBST1N14     PIC S9(9) COMP.                                 
               05  QBST1N15     PIC S9(9) COMP.                                 
               05  QBST1N16     PIC S9(9) COMP.                                 
               05  QBST1N17     PIC S9(9) COMP.                                 
               05  QBST1N18     PIC S9(9) COMP.                                 
               05  QBST1N19     PIC S9(9) COMP.                                 
               05  QBST1N20     PIC S9(9) COMP.                                 
               05  QBST1N21     PIC S9(9) COMP.                                 
               05  QBST1N22     PIC S9(9) COMP.                                 
               05  QBST1N23     PIC S9(9) COMP.                                 
               05  QBST1N24     PIC S9(9) COMP.                                 
               05  QBST1N25     PIC S9(9) COMP.                                 
               05  QBST1N26     PIC S9(9) COMP.                                 
               05  QBST1N27     PIC S9(9) COMP.                                 
               05  QBST1N28     PIC S9(9) COMP.                                 
           03  QBST2.                                                           
               05  QBST2N1      PIC S9(9) COMP VALUE -1.                        
               05  QBST2N2      PIC S9(9) COMP.                                 
               05  QBST2N3      PIC S9(9) COMP.                                 
               05  QBST2N4      PIC S9(9) COMP.                                 
               05  QBST2N5      PIC S9(9) COMP.                                 
               05  QBST2N6      PIC S9(9) COMP.                                 
               05  QBST2N7      PIC S9(9) COMP.                                 
               05  QBST2N8      PIC S9(9) COMP.                                 
               05  QBST2N9      PIC S9(9) COMP.                                 
               05  QBST2N10     PIC S9(9) COMP.                                 
               05  QBST2N11     PIC S9(9) COMP.                                 
               05  QBST2N12     PIC S9(9) COMP.                                 
               05  QBST2N13     PIC S9(9) COMP.                                 
               05  QBST2N14     PIC S9(9) COMP.                                 
               05  QBST2N15     PIC S9(9) COMP.                                 
               05  QBST2N16     PIC S9(9) COMP.                                 
               05  QBST2N17     PIC S9(9) COMP.                                 
               05  QBST2N18     PIC S9(9) COMP.                                 
               05  QBST2N19     PIC S9(9) COMP.                                 
               05  QBST2N20     PIC S9(9) COMP.                                 
               05  QBST2N21     PIC S9(9) COMP.                                 
               05  QBST2N22     PIC S9(9) COMP.                                 
               05  QBST2N23     PIC S9(9) COMP.                                 
               05  QBST2N24     PIC S9(9) COMP.                                 
               05  QBST2N25     PIC S9(9) COMP.                                 
               05  QBST2N26     PIC S9(9) COMP.                                 
               05  QBST2N27     PIC S9(9) COMP.                                 
               05  QBST2N28     PIC S9(9) COMP.                                 
           03  QBST3.                                                           
               05  QBST3N1      PIC S9(9) COMP VALUE -1.                        
               05  QBST3N2      PIC S9(9) COMP.                                 
               05  QBST3N3      PIC S9(9) COMP.                                 
               05  QBST3N4      PIC S9(9) COMP.                                 
               05  QBST3N5      PIC S9(9) COMP.                                 
               05  QBST3N6      PIC S9(9) COMP.                                 
               05  QBST3N7      PIC S9(9) COMP.                                 
               05  QBST3N8      PIC S9(9) COMP.                                 
               05  QBST3N9      PIC S9(9) COMP.                                 
               05  QBST3N10     PIC S9(9) COMP.                                 
               05  QBST3N11     PIC S9(9) COMP.                                 
               05  QBST3N12     PIC S9(9) COMP.                                 
               05  QBST3N13     PIC S9(9) COMP.                                 
               05  QBST3N14     PIC S9(9) COMP.                                 
               05  QBST3N15     PIC S9(9) COMP.                                 
               05  QBST3N16     PIC S9(9) COMP.                                 
               05  QBST3N17     PIC S9(9) COMP.                                 
               05  QBST3N18     PIC S9(9) COMP.                                 
               05  QBST3N19     PIC S9(9) COMP.                                 
               05  QBST3N20     PIC S9(9) COMP.                                 
               05  QBST3N21     PIC S9(9) COMP.                                 
               05  QBST3N22     PIC S9(9) COMP.                                 
               05  QBST3N23     PIC S9(9) COMP.                                 
               05  QBST3N24     PIC S9(9) COMP.                                 
               05  QBST3N25     PIC S9(9) COMP.                                 
               05  QBST3N26     PIC S9(9) COMP.                                 
               05  QBST3N27     PIC S9(9) COMP.                                 
               05  QBST3N28     PIC S9(9) COMP.                                 
           03  QBST4.                                                           
               05  QBST4N1      PIC S9(9) COMP VALUE -1.                        
               05  QBST4N2      PIC S9(9) COMP.                                 
               05  QBST4N3      PIC S9(9) COMP.                                 
               05  QBST4N4      PIC S9(9) COMP.                                 
               05  QBST4N5      PIC S9(9) COMP.                                 
               05  QBST4N6      PIC S9(9) COMP.                                 
               05  QBST4N7      PIC S9(9) COMP.                                 
               05  QBST4N8      PIC S9(9) COMP.                                 
               05  QBST4N9      PIC S9(9) COMP.                                 
               05  QBST4N10     PIC S9(9) COMP.                                 
               05  QBST4N11     PIC S9(9) COMP.                                 
               05  QBST4N12     PIC S9(9) COMP.                                 
               05  QBST4N13     PIC S9(9) COMP.                                 
               05  QBST4N14     PIC S9(9) COMP.                                 
               05  QBST4N15     PIC S9(9) COMP.                                 
               05  QBST4N16     PIC S9(9) COMP.                                 
               05  QBST4N17     PIC S9(9) COMP.                                 
               05  QBST4N18     PIC S9(9) COMP.                                 
               05  QBST4N19     PIC S9(9) COMP.                                 
               05  QBST4N20     PIC S9(9) COMP.                                 
               05  QBST4N21     PIC S9(9) COMP.                                 
               05  QBST4N22     PIC S9(9) COMP.                                 
               05  QBST4N23     PIC S9(9) COMP.                                 
               05  QBST4N24     PIC S9(9) COMP.                                 
               05  QBST4N25     PIC S9(9) COMP.                                 
               05  QBST4N26     PIC S9(9) COMP.                                 
               05  QBST4N27     PIC S9(9) COMP.                                 
               05  QBST4N28     PIC S9(9) COMP.                                 
           03  QTXA.                                                            
               05  QTXAN1       PIC S9(9) COMP.                                 
               05  QTXAN2       PIC S9(9) COMP.                                 
               05  QTXAN3       PIC S9(9) COMP.                                 
               05  QTXAN4       PIC S9(9) COMP.                                 
               05  QTXAN5       PIC S9(9) COMP.                                 
               05  QTXAN6       PIC S9(9) COMP.                                 
               05  QTXAN7       PIC S9(3) COMP.                                 
               05  QTXAN8       PIC S9(3) COMP.                                 
               05  QTXAN9       PIC S9(9) COMP.                                 
               05  QTXAN10      PIC S9(9) COMP.                                 
               05  QTXAN11      PIC S9(9) COMP.                                 
               05  QTXAN12      PIC S9(9) COMP.                                 
               05  QTXAN13      PIC S9(9) COMP.                                 
               05  QTXAN14      PIC S9(9) COMP.                                 
               05  QTXAN15      PIC S9(9) COMP.                                 
               05  QTXAN16      PIC S9(9) COMP.                                 
               05  QTXAN17      PIC S9(9) COMP.                                 
               05  QTXAN18      PIC S9(9) COMP.                                 
               05  QTXAN19      PIC S9(9) COMP.                                 
           03  QISE.                                                            
               05  QISEN1       PIC S9(9) COMP.                                 
               05  QISEN2       PIC S9(9) COMP.                                 
               05  QISEN3       PIC S9(9) COMP.                                 
               05  QISEN4       PIC S9(9) COMP.                                 
               05  QISEN5       PIC S9(9) COMP.                                 
               05  QISEN6       PIC S9(9) COMP.                                 
               05  QISEN7       PIC S9(9) COMP.                                 
               05  QISEN8       PIC S9(9) COMP.                                 
               05  QISEN9       PIC S9(9) COMP.                                 
               05  QISEN10      PIC S9(9) COMP.                                 
           03  DB-STATS-TIMESTAMP PIC S9(18) COMP.                              
      ******************************************************************        
      * DISPLAY THREAD OUTPUT                                                   
      ******************************************************************        
       01  ACTIVE-THREADS.                                                      
           03  FILLER           PIC X(8) VALUE 'WORKTHRD'.                      
           03  NUM-THREADS      PIC S9(9) COMP.                                 
           03  THREADS OCCURS 1 TO 256 TIMES DEPENDING ON NUM-THREADS.          
               05  CONNECTION-TYPE PIC X(8).                                    
               05  FILLER       PIC X.                                          
               05  STATUS-IND   PIC X(2).                                       
               05  FILLER       PIC X.                                          
               05  ACT-IND      PIC X.                                          
               05  FILLER       PIC X.                                          
               05  ACT-COUNTER  PIC X(5).                                       
               05  FILLER       PIC X.                                          
               05  CORR-ID      PIC X(12).                                      
               05  FILLER       PIC X.                                          
               05  AUTH-ID      PIC X(8).                                       
               05  FILLER       PIC X.                                          
               05  PLAN         PIC X(8).                                       
               05  FILLER       PIC X.                                          
               05  THRED-ASID   PIC X(4).                                       
               05  FILLER       PIC X.                                          
       01  THREAD-COUNTER       PIC S9(9) COMP.                                 
      ******************************************************************        
      * ACTIVE THREAD DETAIL STATISTICS                                         
      ******************************************************************        
       01  THREAD-DETAIL.                                                       
           03  FILLER           PIC X(8) VALUE 'THREADS'.                       
           03  TD-CORR-ID       PIC X(12).                                      
           03  TD-TIME-STAMP    PIC S9(18) COMP.                                
           03  BEG-TIME-STAMP   PIC S9(18) COMP.                                
           03  END-TIME-STAMP   PIC S9(18) COMP.                                
           03  AWAC.                                                            
               05  AWACN1       PIC S9(18) COMP.                                
               05  AWACN2       PIC S9(18) COMP.                                
               05  AWACN3       PIC S9(18) COMP.                                
               05  AWACN4       PIC S9(18) COMP.                                
               05  AWACN5       PIC S9(18) COMP.                                
               05  AWACN6       PIC S9(9) COMP.                                 
               05  AWACN7       PIC S9(9) COMP.                                 
           03  AXST.                                                            
               05  AXSTN1       PIC S9(9) COMP.                                 
               05  AXSTN2       PIC S9(9) COMP.                                 
               05  AXSTN3       PIC S9(9) COMP.                                 
               05  AXSTN4       PIC S9(9) COMP.                                 
               05  AXSTN5       PIC S9(9) COMP.                                 
               05  AXSTN6       PIC S9(9) COMP.                                 
               05  AXSTN7       PIC S9(9) COMP.                                 
               05  AXSTN8       PIC S9(9) COMP.                                 
               05  AXSTN9       PIC S9(9) COMP.                                 
               05  AXSTN10      PIC S9(9) COMP.                                 
               05  AXSTN11      PIC S9(9) COMP.                                 
               05  AXSTN12      PIC S9(9) COMP.                                 
               05  AXSTN13      PIC S9(9) COMP.                                 
               05  AXSTN14      PIC S9(9) COMP.                                 
               05  AXSTN15      PIC S9(9) COMP.                                 
               05  AXSTN16      PIC S9(9) COMP.                                 
               05  AXSTN17      PIC S9(9) COMP.                                 
               05  AXSTN18      PIC S9(9) COMP.                                 
               05  AXSTN19      PIC S9(9) COMP.                                 
               05  AXSTN20      PIC S9(9) COMP.                                 
               05  AXSTN21      PIC S9(9) COMP.                                 
               05  AXSTN22      PIC S9(9) COMP.                                 
               05  AXSTN23      PIC S9(9) COMP.                                 
               05  AXSTN24      PIC S9(9) COMP.                                 
               05  AXSTN25      PIC S9(9) COMP.                                 
               05  AXSTN26      PIC S9(9) COMP.                                 
               05  AXSTN27      PIC S9(9) COMP.                                 
               05  AXSTN28      PIC S9(9) COMP.                                 
               05  AXSTN29      PIC S9(9) COMP.                                 
               05  AXSTN30      PIC S9(9) COMP.                                 
               05  AXSTN31      PIC S9(9) COMP.                                 
               05  AXSTN32      PIC S9(9) COMP.                                 
               05  AXSTN33      PIC S9(9) COMP.                                 
               05  AXSTN34      PIC S9(9) COMP.                                 
           03  ABAC.                                                            
               05  ABAC1N1      PIC S9(9) COMP.                                 
               05  ABAC1N2      PIC S9(9) COMP.                                 
               05  ABAC1N3      PIC S9(9) COMP.                                 
               05  ABAC1N4      PIC S9(9) COMP.                                 
               05  ABAC1N5      PIC S9(9) COMP.                                 
               05  ABAC1N6      PIC S9(9) COMP.                                 
               05  ABAC1N7      PIC S9(9) COMP.                                 
               05  ABAC1N8      PIC S9(9) COMP.                                 
               05  ABAC2N1      PIC S9(9) COMP.                                 
               05  ABAC2N2      PIC S9(9) COMP.                                 
               05  ABAC2N3      PIC S9(9) COMP.                                 
               05  ABAC2N4      PIC S9(9) COMP.                                 
               05  ABAC2N5      PIC S9(9) COMP.                                 
               05  ABAC2N6      PIC S9(9) COMP.                                 
               05  ABAC2N7      PIC S9(9) COMP.                                 
               05  ABAC2N8      PIC S9(9) COMP.                                 
               05  ABAC3N1      PIC S9(9) COMP.                                 
               05  ABAC3N2      PIC S9(9) COMP.                                 
               05  ABAC3N3      PIC S9(9) COMP.                                 
               05  ABAC3N4      PIC S9(9) COMP.                                 
               05  ABAC3N5      PIC S9(9) COMP.                                 
               05  ABAC3N6      PIC S9(9) COMP.                                 
               05  ABAC3N7      PIC S9(9) COMP.                                 
               05  ABAC3N8      PIC S9(9) COMP.                                 
               05  ABAC4N1      PIC S9(9) COMP.                                 
               05  ABAC4N2      PIC S9(9) COMP.                                 
               05  ABAC4N3      PIC S9(9) COMP.                                 
               05  ABAC4N4      PIC S9(9) COMP.                                 
               05  ABAC4N5      PIC S9(9) COMP.                                 
               05  ABAC4N6      PIC S9(9) COMP.                                 
               05  ABAC4N7      PIC S9(9) COMP.                                 
               05  ABAC4N8      PIC S9(9) COMP.                                 
           03  ATXA.                                                            
               05  ATXAN1       PIC S9(9) COMP.                                 
               05  ATXAN2       PIC S9(9) COMP.                                 
               05  ATXAN3       PIC S9(9) COMP.                                 
               05  ATXAN4       PIC S9(9) COMP.                                 
               05  ATXAN5       PIC S9(9) COMP.                                 
               05  ATXAN6       PIC S9(9) COMP.                                 
               05  ATXAN7       PIC X(2).                                       
               05  ATXAN9       PIC X(2).                                       
               05  ATXAN10      PIC S9(9) COMP.                                 
               05  ATXAN11      PIC S9(9) COMP.                                 
               05  ATXAN12      PIC S9(9) COMP.                                 
               05  ATXAN13      PIC S9(9) COMP.                                 
               05  ATXAN14      PIC S9(9) COMP.                                 
               05  ATXAN15      PIC S9(9) COMP.                                 
               05  ATXAN16      PIC S9(9) COMP.                                 
               05  ATXAN17      PIC S9(9) COMP.                                 
               05  ATXAN18      PIC S9(9) COMP.                                 
               05  ATXAN19      PIC S9(9) COMP.                                 
               05  ATXAN20      PIC S9(9) COMP.                                 
           03  ACORR.                                                           
               05  ACORRN1      PIC X(8).                                       
               05  ACORRN2      PIC X(12).                                      
               05  ACORRN3      PIC X(8).                                       
               05  ACORRN4      PIC X(8).                                       
      ******************************************************************        
      * PRINT BUFFERS FOR DISPLAYING DB2 SYSTEM STATISTICS                      
      ******************************************************************        
       01  OUTPUT-00.                                                           
           03  FILLER           PIC X(28) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(18) VALUE 'SYSTEM STATISTICS'.            
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(28) VALUE ALL '*'.                        
       01  OUTPUT-01.                                                           
           03  FILLER           PIC X(15) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(10) VALUE 'G.M.T. =='.                    
           03  SYSTEM-STAT-TIME-OUT PIC X(12).                                  
           03  FILLER           PIC X(15) VALUE 'JULIAN DATE =='.               
           03  SYSTEM-STAT-DATE-OUT PIC 9(7).                                   
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(15) VALUE ALL '*'.                        
       01  OUTPUT-1.                                                            
           03  FILLER           PIC X(16) VALUE 'PROC'.                         
           03  QWSAPRC1         PIC X(4).                                       
           03  FILLER           PIC X(10) VALUE ' TCB'.                         
           03  QWSATCB1-OUT     PIC Z(5).9999.                                  
           03  FILLER           PIC X(10) VALUE ' SRB'.                         
           03  QWSASRB1-OUT     PIC Z(5).9999.                                  
           03  FILLER           PIC X(16) VALUE ' ASID'.                        
           03  QWSAASN1         PIC 9(4).                                       
       01  OUTPUT-2.                                                            
           03  FILLER           PIC X(16) VALUE 'PROC'.                         
           03  QWSAPRC2         PIC X(4).                                       
           03  FILLER           PIC X(10) VALUE ' TCB'.                         
           03  QWSATCB2-OUT     PIC Z(5).9999.                                  
           03  FILLER           PIC X(10) VALUE ' SRB'.                         
           03  QWSASRB2-OUT     PIC Z(5).9999.                                  
           03  FILLER           PIC X(16) VALUE ' ASID'.                        
           03  QWSAASN2         PIC X(4).                                       
       01  OUTPUT-3.                                                            
           03  FILLER           PIC X(16) VALUE 'PROC'.                         
           03  QWSAPRC3         PIC X(4).                                       
           03  FILLER           PIC X(10) VALUE ' TCB'.                         
           03  QWSATCB3-OUT     PIC Z(5).9999.                                  
           03  FILLER           PIC X(10) VALUE ' SRB'.                         
           03  QWSASRB3-OUT     PIC Z(5).9999.                                  
           03  FILLER           PIC X(16) VALUE ' ASID'.                        
           03  QWSAASN3         PIC X(4).                                       
       01  OUTPUT-ASTERISKS.                                                    
           03  FILLER           PIC X(80) VALUE ALL '*'.                        
       01  OUTPUT-4.                                                            
           03  FILLER           PIC X(12) VALUE 'IDENTIFY'.                     
           03  Q3STN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SIGNON'.                      
           03  Q3STN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CREA THRD'.                   
           03  Q3STN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' TERM THRD'.                   
           03  Q3STN4           PIC Z(7)9.                                      
       01  OUTPUT-5.                                                            
           03  FILLER           PIC X(12) VALUE 'UOR RESLV'.                    
           03  Q3STN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' COMM PH1'.                    
           03  Q3STN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' COMM PH2'.                    
           03  Q3STN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ABENDS'.                      
           03  Q3STN8           PIC Z(7)9.                                      
       01  OUTPUT-6.                                                            
           03  FILLER           PIC X(12) VALUE 'COMM SNGL'.                    
           03  Q3STN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' UOR IND '.                    
           03  Q3STN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SSAM EOT'.                    
           03  Q3STN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SSAM EOM'.                    
           03  Q3STN12          PIC Z(7)9.                                      
       01  OUTPUT-7.                                                            
           03  FILLER           PIC X(12) VALUE 'TOTAL SSI'.                    
           03  Q3STN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' QD THREADS'.                  
           03  Q3STN14          PIC Z(7)9.                                      
       01  OUTPUT-8.                                                            
           03  FILLER           PIC X(12) VALUE 'DIS DB   '.                    
           03  Q9STN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DIS THRD'.                    
           03  Q9STN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DIS UTIL'.                    
           03  Q9STN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' REC BSDS'.                    
           03  Q9STN4           PIC Z(7)9.                                      
       01  OUTPUT-9.                                                            
           03  FILLER           PIC X(12) VALUE 'REC INDOUBT'.                  
           03  Q9STN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' STA DB  '.                    
           03  Q9STN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' STA TRACE'.                   
           03  Q9STN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' STA SUBSYS'.                  
           03  Q9STN8           PIC Z(7)9.                                      
       01  OUTPUT-10.                                                           
           03  FILLER           PIC X(12) VALUE 'STOP DB    '.                  
           03  Q9STN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' STOP TRACE'.                  
           03  Q9STN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' STOP SS  '.                   
           03  Q9STN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' TERM UTIL '.                  
           03  Q9STN12          PIC Z(7)9.                                      
       01  OUTPUT-11.                                                           
           03  FILLER           PIC X(12) VALUE 'DIS TRACE  '.                  
           03  Q9STN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' RESERVED  '.                  
           03  Q9STN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' UNRECOGNIZ'.                  
           03  Q9STN15          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' STA RLIMIT'.                  
           03  Q9STN16          PIC Z(7)9.                                      
       01  OUTPUT-12.                                                           
           03  FILLER           PIC X(12) VALUE 'STOP RLIM  '.                  
           03  Q9STN17          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DIS RLIM  '.                  
           03  Q9STN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MOD TRACE '.                  
           03  Q9STN19          PIC Z(7)9.                                      
       01  OUTPUT-13.                                                           
           03  FILLER           PIC X(17) VALUE 'CHECKPOINT COUNT '.            
           03  QWSDN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(24) VALUE                                 
           'HIGH USED LOG RBA (HEX) '.                                          
           03  QWSDN2           PIC X(16).                                      
       01  OUTPUT-14.                                                           
           03  FILLER           PIC X(12) VALUE 'WRITE WAIT '.                  
           03  QJSTN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WRT NOWAIT'.                  
           03  QJSTN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WRT FORCE '.                  
           03  QJSTN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WAIT ACBUF'.                  
           03  QJSTN4           PIC Z(7)9.                                      
       01  OUTPUT-15.                                                           
           03  FILLER           PIC X(12) VALUE 'READ BUFFER'.                  
           03  QJSTN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' READ ACTIV'.                  
           03  QJSTN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' READ ARCH '.                  
           03  QJSTN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' READ DELAY'.                  
           03  QJSTN8           PIC Z(7)9.                                      
       01  OUTPUT-16.                                                           
           03  FILLER           PIC X(12) VALUE 'BSDS ACCESS'.                  
           03  QJSTN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ARCH CISSS'.                  
           03  QJSTN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WRITE ACT '.                  
           03  QJSTN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ARC RALLOC'.                  
           03  QJSTN12          PIC Z(7)9.                                      
       01  OUTPUT-17.                                                           
           03  FILLER           PIC X(12) VALUE 'ARC WALLOC '.                  
           03  QJSTN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CI COUNT  '.                  
           03  QJSTN14          PIC Z(7)9.                                      
       01  OUTPUT-1701.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LVL1 '.                  
           03  QVLSN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LVL2'.                  
           03  QVLSN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LVL3'.                  
           03  QVLSN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LVL4'.                  
           03  QVLSN4           PIC Z(7)9.                                      
       01  OUTPUT-1702.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LVL5 '.                  
           03  QVLSN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LVL6'.                  
           03  QVLSN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LVL7'.                  
           03  QVLSN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LVL8'.                  
           03  QVLSN8           PIC Z(7)9.                                      
       01  OUTPUT-1703.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LVL9 '.                  
           03  QVLSN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV10'.                  
           03  QVLSN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV11'.                  
           03  QVLSN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV12'.                  
           03  QVLSN12          PIC Z(7)9.                                      
       01  OUTPUT-1704.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LV13 '.                  
           03  QVLSN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV14'.                  
           03  QVLSN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV15'.                  
           03  QVLSN15          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV16'.                  
           03  QVLSN16          PIC Z(7)9.                                      
       01  OUTPUT-1705.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LV17 '.                  
           03  QVLSN17          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV18'.                  
           03  QVLSN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV19'.                  
           03  QVLSN19          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV20'.                  
           03  QVLSN20          PIC Z(7)9.                                      
       01  OUTPUT-1706.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LV21 '.                  
           03  QVLSN21          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV22'.                  
           03  QVLSN22          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV23'.                  
           03  QVLSN23          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV24'.                  
           03  QVLSN24          PIC Z(7)9.                                      
       01  OUTPUT-1707.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LV25 '.                  
           03  QVLSN25          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV26'.                  
           03  QVLSN26          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV27'.                  
           03  QVLSN27          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV28'.                  
           03  QVLSN28          PIC Z(7)9.                                      
       01  OUTPUT-1708.                                                         
           03  FILLER           PIC X(12) VALUE 'LATCH LV29 '.                  
           03  QVLSN29          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV30'.                  
           03  QVLSN30          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV31'.                  
           03  QVLSN31          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LATCH LV32'.                  
           03  QVLSN32          PIC Z(7)9.                                      
       01  OUTPUT-1709.                                                         
           03  FILLER           PIC X(12) VALUE 'PHY SUSPND '.                  
           03  QVASN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EUS SU SRB'.                  
           03  QVASN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EUS SU TCB'.                  
           03  QVASN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EUS AU SRB'.                  
           03  QVASN4           PIC Z(7)9.                                      
       01  OUTPUT-1710.                                                         
           03  FILLER           PIC X(12) VALUE 'EUS AU TCB '.                  
           03  QVASN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EUS SR SRB'.                  
           03  QVASN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EUS SR TCB'.                  
           03  QVASN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ADC U RSRC'.                  
           03  QVASN8           PIC Z(7)9.                                      
       01  OUTPUT-1711.                                                         
           03  FILLER           PIC X(12) VALUE ' ADC A DDLK'.                  
           03  QVASN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ADC I RSRC'.                  
           03  QVASN10          PIC Z(7)9.                                      
      ******************************************************************        
      * PRINT BUFFERS FOR DATA BASE STATISTICS                                  
      ******************************************************************        
       01  OUTPUT-190.                                                          
           03  FILLER           PIC X(27) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(20) VALUE 'DATA BASE STATISTICS'.         
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(27) VALUE ALL '*'.                        
       01  OUTPUT-191.                                                          
           03  FILLER           PIC X(15) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(10) VALUE 'G.M.T. =='.                    
           03  DB-STATS-TIME-OUT PIC X(12).                                     
           03  FILLER           PIC X(15) VALUE 'JULIAN DATE =='.               
           03  DB-STATS-DATE-OUT PIC 9(7).                                      
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(15) VALUE ALL '*'.                        
       01  OUTPUT-20.                                                           
           03  FILLER           PIC X(12) VALUE 'SELECTS '.                     
           03  QXSTN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' INSERTS'.                     
           03  QXSTN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' UPDATES  '.                   
           03  QXSTN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DELETES  '.                   
           03  QXSTN4           PIC Z(7)9.                                      
       01  OUTPUT-21.                                                           
           03  FILLER           PIC X(12) VALUE 'DESCRIBES  '.                  
           03  QXSTN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PREPARES  '.                  
           03  QXSTN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' OPENS     '.                  
           03  QXSTN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CLOSES    '.                  
           03  QXSTN8           PIC Z(7)9.                                      
       01  OUTPUT-22.                                                           
           03  FILLER           PIC X(12) VALUE 'CR TABLE   '.                  
           03  QXSTN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR INDEX  '.                  
           03  QXSTN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR TSPACE '.                  
           03  QXSTN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR SYN    '.                  
           03  QXSTN12          PIC Z(7)9.                                      
       01  OUTPUT-23.                                                           
           03  FILLER           PIC X(12) VALUE 'CR DBASE   '.                  
           03  QXSTN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR STOGRP '.                  
           03  QXSTN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR VIEW   '.                  
           03  QXSTN15          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR INDEX  '.                  
           03  QXSTN16          PIC Z(7)9.                                      
       01  OUTPUT-24.                                                           
           03  FILLER           PIC X(12) VALUE 'DR TABLE   '.                  
           03  QXSTN17          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR TSPACE '.                  
           03  QXSTN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR DBASE  '.                  
           03  QXSTN19          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR SYN    '.                  
           03  QXSTN20          PIC Z(7)9.                                      
       01  OUTPUT-25.                                                           
           03  FILLER           PIC X(12) VALUE 'DR STGRP   '.                  
           03  QXSTN21          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR VIEW   '.                  
           03  QXSTN22          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ALT STGRP '.                  
           03  QXSTN23          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' FETCHES   '.                  
           03  QXSTN24          PIC Z(7)9.                                      
       01  OUTPUT-26.                                                           
           03  FILLER           PIC X(12) VALUE 'ALT TSPACE '.                  
           03  QXSTN25          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ALT TABLE '.                  
           03  QXSTN26          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ALT INDEX '.                  
           03  QXSTN27          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' COMMENT ON'.                  
           03  QXSTN28          PIC Z(7)9.                                      
       01  OUTPUT-27.                                                           
           03  FILLER           PIC X(12) VALUE 'LOCK TBL   '.                  
           03  QXSTN29          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GRANT     '.                  
           03  QXSTN30          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' REVOKES   '.                  
           03  QXSTN31          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' INC BINDS '.                  
           03  QXSTN32          PIC Z(7)9.                                      
       01  OUTPUT-28.                                                           
           03  FILLER           PIC X(12) VALUE 'LABEL ON   '.                  
           03  QXSTN33          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SET SQLID '.                  
           03  QXSTN34          PIC Z(7)9.                                      
       01  OUTPUT-29.                                                           
           03  FILLER           PIC X(12) VALUE 'ATT ALLOC  '.                  
           03  QTSTN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUCC ALLOC'.                  
           03  QTSTN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' AUTO BINDS'.                  
           03  QTSTN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUCC AUBND'.                  
           03  QTSTN4           PIC Z(7)9.                                      
       01  OUTPUT-30.                                                           
           03  FILLER           PIC X(12) VALUE 'INVALID RES'.                  
           03  QTSTN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BIND ADDSB'.                  
           03  QTSTN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BIND RESUB'.                  
           03  QTSTN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' TEST BINDS'.                  
           03  QTSTN8           PIC Z(7)9.                                      
       01  OUTPUT-31.                                                           
           03  FILLER           PIC X(12) VALUE 'PLANS BOUND'.                  
           03  QTSTN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' REBIND SUB'.                  
           03  QTSTN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ATT REBIND'.                  
           03  QTSTN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PLNS REBND'.                  
           03  QTSTN12          PIC Z(7)9.                                      
       01  OUTPUT-32.                                                           
           03  FILLER           PIC X(12) VALUE 'FREE SUB   '.                  
           03  QTSTN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ATT FREES '.                  
           03  QTSTN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PLNS FREED'.                  
           03  QTSTN15          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' AUTH CHEKS'.                  
           03  QTSTN16          PIC Z(7)9.                                      
       01  OUTPUT-33.                                                           
           03  FILLER           PIC X(12) VALUE 'SUCC AUTHS '.                  
           03  QTSTN17          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CURR OPNDS'.                  
           03  QTSTN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MAX OPNDS '.                  
           03  QTSTN19          PIC Z(7)9.                                      
       01  OUTPUT-34.                                                           
           03  FILLER           PIC X(12) VALUE 'BUFFPOOL ID'.                  
           03  QBST1N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  QBST1N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  QBST1N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BPOOL EXPS'.                  
           03  QBST1N4          PIC Z(7)9.                                      
       01  OUTPUT-35.                                                           
           03  FILLER           PIC X(12) VALUE 'EXP FAIL MX'.                  
           03  QBST1N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EXPFAIL GM'.                  
           03  QBST1N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BUFF UPDS '.                  
           03  QBST1N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW UW   '.                  
           03  QBST1N8          PIC Z(7)9.                                      
       01  OUTPUT-36.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGES WRITN'.                  
           03  QBST1N9          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PW UW     '.                  
           03  QBST1N10         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ASYNC WRIT'.                  
           03  QBST1N11         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CURR ACBUF'.                  
           03  QBST1N12         PIC Z(7)9.                                      
       01  OUTPUT-37.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGEIN RIO '.                  
           03  QBST1N13         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PAGEIN WIO'.                  
           03  QBST1N14         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUCC OPENS'.                  
           03  QBST1N15         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  QBST1N16         PIC Z(7)9.                                      
       01  OUTPUT-38.                                                           
           03  FILLER           PIC X(12) VALUE 'SEQ PRE REQ'.                  
           03  QBST1N17         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SP PAGREAD'.                  
           03  QBST1N18         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOBUF'.                  
           03  QBST1N19         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOENG'.                  
           03  QBST1N20         PIC Z(7)9.                                      
       01  OUTPUT-39.                                                           
           03  FILLER           PIC X(12) VALUE 'DEF WRITE  '.                  
           03  QBST1N21         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DM CRITICL'.                  
           03  QBST1N22         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MIG DS    '.                  
           03  QBST1N23         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' RCL TIMOUT'.                  
           03  QBST1N24         PIC Z(7)9.                                      
       01  OUTPUT-40.                                                           
           03  FILLER           PIC X(12) VALUE 'PF ASY-READ'.                  
           03  QBST1N25         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF ABRT ZZ'.                  
           03  QBST1N26         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WKFIL FAIL'.                  
           03  QBST1N27         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF DIS DUP'.                  
           03  QBST1N28         PIC Z(7)9.                                      
       01  OUTPUT-41.                                                           
           03  FILLER           PIC X(12) VALUE 'BUFFPOOL ID'.                  
           03  QBST2N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  QBST2N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  QBST2N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BPOOL EXPS'.                  
           03  QBST2N4          PIC Z(7)9.                                      
       01  OUTPUT-42.                                                           
           03  FILLER           PIC X(12) VALUE 'EXP FAIL MX'.                  
           03  QBST2N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EXPFAIL GM'.                  
           03  QBST2N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BUFF UPDS '.                  
           03  QBST2N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW UW   '.                  
           03  QBST2N8          PIC Z(7)9.                                      
       01  OUTPUT-43.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGES WRITN'.                  
           03  QBST2N9          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PW UW     '.                  
           03  QBST2N10         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ASYNC WRIT'.                  
           03  QBST2N11         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CURR ACBUF'.                  
           03  QBST2N12         PIC Z(7)9.                                      
       01  OUTPUT-44.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGEIN RIO '.                  
           03  QBST2N13         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PAGEIN WIO'.                  
           03  QBST2N14         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUCC OPENS'.                  
           03  QBST2N15         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  QBST2N16         PIC Z(7)9.                                      
       01  OUTPUT-45.                                                           
           03  FILLER           PIC X(12) VALUE 'SEQ PRE REQ'.                  
           03  QBST2N17         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SP PAGREAD'.                  
           03  QBST2N18         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOBUF'.                  
           03  QBST2N19         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOENG'.                  
           03  QBST2N20         PIC Z(7)9.                                      
       01  OUTPUT-46.                                                           
           03  FILLER           PIC X(12) VALUE 'DEF WRITE  '.                  
           03  QBST2N21         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DM CRITICL'.                  
           03  QBST2N22         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MIG DS    '.                  
           03  QBST2N23         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' RCL TIMOUT'.                  
           03  QBST2N24         PIC Z(7)9.                                      
       01  OUTPUT-47.                                                           
           03  FILLER           PIC X(12) VALUE 'PF ASY-READ'.                  
           03  QBST2N25         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF ABRT ZZ'.                  
           03  QBST2N26         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WKFIL FAIL'.                  
           03  QBST2N27         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF DIS DUP'.                  
           03  QBST2N28         PIC Z(7)9.                                      
       01  OUTPUT-48.                                                           
           03  FILLER           PIC X(12) VALUE 'BUFFPOOL ID'.                  
           03  QBST3N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  QBST3N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  QBST3N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BPOOL EXPS'.                  
           03  QBST3N4          PIC Z(7)9.                                      
       01  OUTPUT-49.                                                           
           03  FILLER           PIC X(12) VALUE 'EXP FAIL MX'.                  
           03  QBST3N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EXPFAIL GM'.                  
           03  QBST3N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BUFF UPDS '.                  
           03  QBST3N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW UW   '.                  
           03  QBST3N8          PIC Z(7)9.                                      
       01  OUTPUT-50.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGES WRITN'.                  
           03  QBST3N9          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PW UW     '.                  
           03  QBST3N10         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ASYNC WRIT'.                  
           03  QBST3N11         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CURR ACBUF'.                  
           03  QBST3N12         PIC Z(7)9.                                      
       01  OUTPUT-51.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGEIN RIO '.                  
           03  QBST3N13         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PAGEIN WIO'.                  
           03  QBST3N14         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUCC OPENS'.                  
           03  QBST3N15         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  QBST3N16         PIC Z(7)9.                                      
       01  OUTPUT-52.                                                           
           03  FILLER           PIC X(12) VALUE 'SEQ PRE REQ'.                  
           03  QBST3N17         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SP PAGREAD'.                  
           03  QBST3N18         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOBUF'.                  
           03  QBST3N19         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOENG'.                  
           03  QBST3N20         PIC Z(7)9.                                      
       01  OUTPUT-53.                                                           
           03  FILLER           PIC X(12) VALUE 'DEF WRITE  '.                  
           03  QBST3N21         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DM CRITICL'.                  
           03  QBST3N22         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MIG DS    '.                  
           03  QBST3N23         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' RCL TIMOUT'.                  
           03  QBST3N24         PIC Z(7)9.                                      
       01  OUTPUT-54.                                                           
           03  FILLER           PIC X(12) VALUE 'PF ASY-READ'.                  
           03  QBST3N25         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF ABRT ZZ'.                  
           03  QBST3N26         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WKFIL FAIL'.                  
           03  QBST3N27         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF DIS DUP'.                  
           03  QBST3N28         PIC Z(7)9.                                      
       01  OUTPUT-55.                                                           
           03  FILLER           PIC X(12) VALUE 'BUFFPOOL ID'.                  
           03  QBST4N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  QBST4N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  QBST4N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BPOOL EXPS'.                  
           03  QBST4N4          PIC Z(7)9.                                      
       01  OUTPUT-56.                                                           
           03  FILLER           PIC X(12) VALUE 'EXP FAIL MX'.                  
           03  QBST4N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' EXPFAIL GM'.                  
           03  QBST4N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BUFF UPDS '.                  
           03  QBST4N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW UW   '.                  
           03  QBST4N8          PIC Z(7)9.                                      
       01  OUTPUT-57.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGES WRITN'.                  
           03  QBST4N9          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PW UW     '.                  
           03  QBST4N10         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ASYNC WRIT'.                  
           03  QBST4N11         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CURR ACBUF'.                  
           03  QBST4N12         PIC Z(7)9.                                      
       01  OUTPUT-58.                                                           
           03  FILLER           PIC X(12) VALUE 'PAGEIN RIO '.                  
           03  QBST4N13         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PAGEIN WIO'.                  
           03  QBST4N14         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUCC OPENS'.                  
           03  QBST4N15         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  QBST4N16         PIC Z(7)9.                                      
       01  OUTPUT-59.                                                           
           03  FILLER           PIC X(12) VALUE 'SEQ PRE REQ'.                  
           03  QBST4N17         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SP PAGREAD'.                  
           03  QBST4N18         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOBUF'.                  
           03  QBST4N19         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PDIS NOENG'.                  
           03  QBST4N20         PIC Z(7)9.                                      
       01  OUTPUT-60.                                                           
           03  FILLER           PIC X(12) VALUE 'DEF WRITE  '.                  
           03  QBST4N21         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DM CRITICL'.                  
           03  QBST4N22         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MIG DS    '.                  
           03  QBST4N23         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' RCL TIMOUT'.                  
           03  QBST4N24         PIC Z(7)9.                                      
       01  OUTPUT-61.                                                           
           03  FILLER           PIC X(12) VALUE 'PF ASY-READ'.                  
           03  QBST4N25         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF ABRT ZZ'.                  
           03  QBST4N26         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WKFIL FAIL'.                  
           03  QBST4N27         PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PF DIS DUP'.                  
           03  QBST4N28         PIC Z(7)9.                                      
       01  OUTPUT-62.                                                           
           03  FILLER           PIC X(12) VALUE 'DEADLOCKS  '.                  
           03  QTXAN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUS LKCON '.                  
           03  QTXAN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' TIMEOUTS  '.                  
           03  QTXAN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LK ESC SHR'.                  
           03  QTXAN4           PIC Z(7)9.                                      
       01  OUTPUT-63.                                                           
           03  FILLER           PIC X(12) VALUE 'LK ESC EXC '.                  
           03  QTXAN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MAX PGLKS '.                  
           03  QTXAN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' FLAG BYTE '.                  
           03  QTXAN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' RLIM ID   '.                  
           03  QTXAN8           PIC Z(7)9.                                      
       01  OUTPUT-64.                                                           
           03  FILLER           PIC X(12) VALUE 'LIMIT DET  '.                  
           03  QTXAN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LIM SU    '.                  
           03  QTXAN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LIM CPU16 '.                  
           03  QTXAN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' HIGH CPU16'.                  
           03  QTXAN12          PIC Z(7)9.                                      
       01  OUTPUT-65.                                                           
           03  FILLER           PIC X(12) VALUE 'LATCH CON  '.                  
           03  QTXAN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' OTHER CON '.                  
           03  QTXAN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(07) VALUE ' LK RQ '.                      
           03  QTXAN15          PIC Z(12)9.                                     
           03  FILLER           PIC X(07) VALUE ' UL RQ '.                      
           03  QTXAN16          PIC Z(12)9.                                     
       01  OUTPUT-66.                                                           
           03  FILLER           PIC X(12) VALUE 'QUERIES    '.                  
           03  QTXAN17          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CHANGES   '.                  
           03  QTXAN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' OTHER     '.                  
           03  QTXAN19          PIC Z(7)9.                                      
       01  OUTPUT-67.                                                           
           03  FILLER           PIC X(12) VALUE 'FULL FAILS '.                  
           03  QISEN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PAGES     '.                  
           03  QISEN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CT REQ    '.                  
           03  QISEN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LOAD CT   '.                  
           03  QISEN4           PIC Z(7)9.                                      
       01  OUTPUT-68.                                                           
           03  FILLER           PIC X(12) VALUE 'CT PAGES   '.                  
           03  QISEN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' FREE PAGES'.                  
           03  QISEN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DBD PAGES '.                  
           03  QISEN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SKCT PAGES'.                  
           03  QISEN8           PIC Z(7)9.                                      
       01  OUTPUT-69.                                                           
           03  FILLER           PIC X(12) VALUE 'DBD REQUEST'.                  
           03  QISEN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LOAD DBD  '.                  
           03  QISEN10          PIC Z(7)9.                                      
      ******************************************************************        
      * PRINT LINES FOR ACTIVE THREAD DETAIL                                    
      ******************************************************************        
       01  OUTPUT-700.                                                          
           03  FILLER           PIC X VALUE '*'.                                
           03  FILLER           PIC X(25) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER     PIC X(22) VALUE 'APPLICATION STATISTICS'.             
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(26) VALUE ALL '*'.                        
       01  OUTPUT-701.                                                          
           03  FILLER           PIC X(9) VALUE ALL '*'.                         
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(20) VALUE ' NUMBER OF TRANS'.             
           03  FILLER           PIC X(13) VALUE 'CORR-ID'.                      
           03  FILLER           PIC X(9) VALUE 'AUTHID'.                        
           03  FILLER           PIC X(9) VALUE 'PLAN'.                          
           03  FILLER           PIC X(4) VALUE '    '.                          
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(10) VALUE ALL '*'.                        
       01  OUTPUT-71.                                                           
           03  FILLER           PIC X(9) VALUE ALL '*'.                         
           03  FILLER           PIC X(4) VALUE '==>'.                           
           03  NUMT-OUT         PIC Z(9)9.                                      
           03  FILLER           PIC X(9) VALUE SPACES.                          
           03  ACORRN2          PIC X(13) VALUE SPACES.                         
           03  ACORRN1          PIC X(5) VALUE SPACES.                          
           03  ACORRN4          PIC X(12).                                      
           03  FILLER           PIC X(4) VALUE SPACES.                          
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(9) VALUE ALL '*'.                         
       01  OUTPUT-TERMINATE.                                                    
           03  FILLER           PIC X(31) VALUE ALL '*'.                        
           03  FILLER           PIC X(18) VALUE 'THREAD TERMINATED'.            
           03  FILLER           PIC X(31) VALUE ALL '*'.                        
       01  OUTPUT-72.                                                           
           03  FILLER           PIC X(15) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(10) VALUE 'G.M.T. =='.                    
           03  APPL-STAT-TIME-OUT PIC X(12).                                    
           03  FILLER           PIC X(15) VALUE 'JULIAN DATE =='.               
           03  APPL-STAT-DATE-OUT PIC 9(7).                                     
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(15) VALUE ALL '*'.                        
       01  OUTPUT-73.                                                           
           03  FILLER           PIC X(10) VALUE 'ELAPSED'.                      
           03  APPL-ELAPSED     PIC Z(5).9999.                                  
           03  FILLER           PIC X(10) VALUE ' TCB'.                         
           03  APPL-TCB         PIC Z(5).9999.                                  
           03  FILLER           PIC X(10) VALUE ' SRB'.                         
           03  APPL-SRB         PIC Z(5).9999.                                  
       01  OUTPUT-74.                                                           
           03  FILLER           PIC X(10) VALUE 'I/O WAIT'.                     
           03  APPL-IOWAIT      PIC Z(5).9999.                                  
           03  FILLER           PIC X(10) VALUE ' LOCK WAIT'.                   
           03  APPL-LOCKWAIT    PIC Z(5).9999.                                  
           03  FILLER           PIC X(12) VALUE ' ENTRY/EXIT'.                  
           03  AWACN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' WAIT TRACE'.                  
           03  AWACN7           PIC Z(7)9.                                      
       01  OUTPUT-75.                                                           
           03  FILLER           PIC X(12) VALUE 'SELECTS '.                     
           03  AXSTN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' INSERTS'.                     
           03  AXSTN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' UPDATES  '.                   
           03  AXSTN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DELETES  '.                   
           03  AXSTN4           PIC Z(7)9.                                      
       01  OUTPUT-76.                                                           
           03  FILLER           PIC X(12) VALUE 'DESCRIBES  '.                  
           03  AXSTN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PREPARES  '.                  
           03  AXSTN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' OPENS     '.                  
           03  AXSTN7           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CLOSES    '.                  
           03  AXSTN8           PIC Z(7)9.                                      
       01  OUTPUT-77.                                                           
           03  FILLER           PIC X(12) VALUE 'CR TABLE   '.                  
           03  AXSTN9           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR INDEX  '.                  
           03  AXSTN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR TSPACE '.                  
           03  AXSTN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR SYN    '.                  
           03  AXSTN12          PIC Z(7)9.                                      
       01  OUTPUT-78.                                                           
           03  FILLER           PIC X(12) VALUE 'CR DBASE   '.                  
           03  AXSTN13          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR STOGRP '.                  
           03  AXSTN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CR VIEW   '.                  
           03  AXSTN15          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR INDEX  '.                  
           03  AXSTN16          PIC Z(7)9.                                      
       01  OUTPUT-79.                                                           
           03  FILLER           PIC X(12) VALUE 'DR TABLE   '.                  
           03  AXSTN17          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR TSPACE '.                  
           03  AXSTN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR DBASE  '.                  
           03  AXSTN19          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR SYN    '.                  
           03  AXSTN20          PIC Z(7)9.                                      
       01  OUTPUT-80.                                                           
           03  FILLER           PIC X(12) VALUE 'DR STGRP   '.                  
           03  AXSTN21          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' DR VIEW   '.                  
           03  AXSTN22          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ALT STGRP '.                  
           03  AXSTN23          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' FETCHES   '.                  
           03  AXSTN24          PIC Z(7)9.                                      
       01  OUTPUT-81.                                                           
           03  FILLER           PIC X(12) VALUE 'ALT TSPACE '.                  
           03  AXSTN25          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ALT TABLE '.                  
           03  AXSTN26          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ALT INDEX '.                  
           03  AXSTN27          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' COMMENT ON'.                  
           03  AXSTN28          PIC Z(7)9.                                      
       01  OUTPUT-82.                                                           
           03  FILLER           PIC X(12) VALUE 'LOCK TBL   '.                  
           03  AXSTN29          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GRANT     '.                  
           03  AXSTN30          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' REVOKES   '.                  
           03  AXSTN31          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' INC BINDS '.                  
           03  AXSTN32          PIC Z(7)9.                                      
       01  OUTPUT-83.                                                           
           03  FILLER           PIC X(12) VALUE 'LABEL ON   '.                  
           03  AXSTN33          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SET SQLID '.                  
           03  AXSTN34          PIC Z(7)9.                                      
       01  OUTPUT-84.                                                           
           03  FILLER           PIC X(12) VALUE 'BPOOL ID   '.                  
           03  ABAC1N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  ABAC1N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BP EXPANTS'.                  
           03  ABAC1N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW SYS  '.                  
           03  ABAC1N4          PIC Z(7)9.                                      
       01  OUTPUT-85.                                                           
           03  FILLER           PIC X(12) VALUE 'SETW UW    '.                  
           03  ABAC1N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  ABAC1N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SEQ PREF  '.                  
           03  ABAC1N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  ABAC1N8          PIC Z(7)9.                                      
       01  OUTPUT-86.                                                           
           03  FILLER           PIC X(12) VALUE 'BPOOL ID   '.                  
           03  ABAC2N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  ABAC2N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BP EXPANTS'.                  
           03  ABAC2N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW SYS  '.                  
           03  ABAC2N4          PIC Z(7)9.                                      
       01  OUTPUT-87.                                                           
           03  FILLER           PIC X(12) VALUE 'SETW UW    '.                  
           03  ABAC2N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  ABAC2N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SEQ PREF  '.                  
           03  ABAC2N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  ABAC2N8          PIC Z(7)9.                                      
       01  OUTPUT-88.                                                           
           03  FILLER           PIC X(12) VALUE 'BPOOL ID   '.                  
           03  ABAC3N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  ABAC3N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BP EXPANTS'.                  
           03  ABAC3N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW SYS  '.                  
           03  ABAC3N4          PIC Z(7)9.                                      
       01  OUTPUT-89.                                                           
           03  FILLER           PIC X(12) VALUE 'SETW UW    '.                  
           03  ABAC3N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  ABAC3N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SEQ PREF  '.                  
           03  ABAC3N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  ABAC3N8          PIC Z(7)9.                                      
       01  OUTPUT-90.                                                           
           03  FILLER           PIC X(12) VALUE 'BPOOL ID   '.                  
           03  ABAC4N1          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' GET PAGES '.                  
           03  ABAC4N2          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' BP EXPANTS'.                  
           03  ABAC4N3          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SETW SYS  '.                  
           03  ABAC4N4          PIC Z(7)9.                                      
       01  OUTPUT-91.                                                           
           03  FILLER           PIC X(12) VALUE 'SETW UW    '.                  
           03  ABAC4N5          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC READS'.                  
           03  ABAC4N6          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SEQ PREF  '.                  
           03  ABAC4N7          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SYNC WRITE'.                  
           03  ABAC4N8          PIC Z(7)9.                                      
       01  OUTPUT-92.                                                           
           03  FILLER           PIC X(12) VALUE 'DEADLOCKS  '.                  
           03  ATXAN1           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' SUS LKCON '.                  
           03  ATXAN2           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' TIMEOUTS  '.                  
           03  ATXAN3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LK ESC SHR'.                  
           03  ATXAN4           PIC Z(7)9.                                      
       01  OUTPUT-93.                                                           
           03  FILLER           PIC X(12) VALUE 'LK ESC EXC '.                  
           03  ATXAN5           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' MAX PGLKS '.                  
           03  ATXAN6           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' FLAG BYTE '.                  
           03  ATXAN7           PIC X(8).                                       
           03  FILLER           PIC X(12) VALUE ' RLIM ID   '.                  
           03  ATXAN9           PIC Z(8).                                       
       01  OUTPUT-94.                                                           
           03  FILLER           PIC X(12) VALUE 'LIMIT DET  '.                  
           03  ATXAN10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LIM SU    '.                  
           03  ATXAN11          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LIM CPU16 '.                  
           03  ATXAN12          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' HIGH CPU16'.                  
           03  ATXAN13          PIC Z(7)9.                                      
       01  OUTPUT-95.                                                           
           03  FILLER           PIC X(12) VALUE 'LATCH CON  '.                  
           03  ATXAN14          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' OTHER CON '.                  
           03  ATXAN15          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' LOCK REQ  '.                  
           03  ATXAN16          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' UNLOCK REQ'.                  
           03  ATXAN17          PIC Z(7)9.                                      
       01  OUTPUT-96.                                                           
           03  FILLER           PIC X(12) VALUE 'QUERIES    '.                  
           03  ATXAN18          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' CHANGES   '.                  
           03  ATXAN19          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' OTHER     '.                  
           03  ATXAN20          PIC Z(7)9.                                      
       01  OUTPUT-97.                                                           
           03  FILLER           PIC X(12) VALUE 'CONN TYPE  '.                  
           03  A148N1           PIC X(8).                                       
           03  FILLER           PIC X(12) VALUE ' REQ COUNT '.                  
           03  A148N3           PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' ASID      '.                  
           03  A148N4           PIC Z(7)9.                                      
           03  FILLER           PIC X(19) VALUE ' APPL OR DB2?'.                
           03  A148N5           PIC X.                                          
       01  OUTPUT-98.                                                           
           03  FILLER           PIC X(18) VALUE 'CONN STATUS'.                  
           03  A148N6           PIC X(2).                                       
           03  FILLER           PIC X(12) VALUE ' LAST IFCID'.                  
           03  A148N10          PIC Z(7)9.                                      
           03  FILLER           PIC X(12) VALUE ' PRIORIFCID'.                  
           03  A148N11          PIC Z(7)9.                                      
       01  OUTPUT-99.                                                           
           03  FILLER           PIC X(12) VALUE 'LOCK HASH  '.                  
           03  A148N12          PIC X(8).                                       
           03  FILLER           PIC X(12) VALUE ' LOCK NAME '.                  
           03  A148N13          PIC X(24).                                      
      ****************************************************************          
      * CICS STATISTICS STUFF                                                   
      ****************************************************************          
       01  OUTPUT-100.                                                          
           03  FILLER           PIC X(28) VALUE ALL '*'.                        
           03  FILLER           PIC X(3) VALUE '==>'.                           
           03  FILLER           PIC X(18) VALUE 'CICS   STATISTICS'.            
           03  FILLER           PIC X(3) VALUE '<=='.                           
           03  FILLER           PIC X(28) VALUE ALL '*'.                        
       01  OUTPUT-101.                                                          
           03  FILLER           PIC X(9) VALUE 'TRANCODE'.                      
           03  FILLER           PIC X(9) VALUE 'PROGNAME'.                      
           03  FILLER           PIC X(9) VALUE 'TOTAL   '.                      
           03  FILLER           PIC X(9) VALUE 'RESTART '.                      
           03  FILLER           PIC X(9) VALUE 'LOCAL   '.                      
           03  FILLER           PIC X(9) VALUE 'REMOTE  '.                      
           03  FILLER           PIC X(9) VALUE 'STGVIOLS'.                      
       01  OUTPUT-102.                                                          
           03  T-CODE           PIC X(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
           03  T-P-NAME         PIC X(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
           03  T-TOTAL          PIC 9(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
           03  T-RESTART        PIC 9(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
           03  T-DYNLOC         PIC 9(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
           03  T-DYNRMT         PIC 9(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
           03  T-STGVIOL        PIC 9(8).                                       
           03  FILLER           PIC X VALUE SPACE.                              
      ****************************************************************          
      * CONSTANTS FOR CONVERTING STCK TO TIME AND DAY                           
      ****************************************************************          
       01  TIMESTAMP.                                                           
           03  DATE-STAMP.                                                      
               05  YEAR          PIC 9(4).                                      
               05  DAYS          PIC 9(3).                                      
           03  TIME-STAMP.                                                      
               05  HOURS         PIC 99.                                        
               05  MINUTES       PIC 99.                                        
               05  SECONDS       PIC 99.9999.                                   
       01  TIME-OF-DAY-CONSTANTS.                                               
           03  FILLER            PIC X(8) VALUE 'TIMEOFDA'.                     
           03  1-SECOND          PIC S9(18) COMP.                               
           03  1-MINUTE          PIC S9(18) COMP.                               
           03  1-DAY             PIC S9(18) COMP.                               
           03  365-DAYS          PIC S9(18) COMP.                               
           03  366-DAYS          PIC S9(18) COMP.                               
           03  1461-DAYS         PIC S9(18) COMP.                               
           03  1988-YEAR         PIC S9(18) COMP.                               
       01  TIME-WORK             PIC S9(18) COMP.                               
       01  TIME-WORK-1           PIC S9(18) COMP.                               
       01  TIME-WORK-2           PIC S9(18) COMP.                               
       01  TIME-WORK-3           PIC S9(18) COMP.                               
       01  TIME-WORK-4           PIC S9(18) COMP.                               
       01  TIME-WORK-5           PIC S9(18) COMP.                               
       01  TIME-WORK-6           PIC S9(18) COMP.                               
       01  TIME-WORK-7           PIC S9(18) COMP.                               
       01  TIME-WORK-8           PIC S9(18) COMP.                               
       01  TIME-WORK-9           PIC S9(18) COMP.                               
       01  DATE-TIME.                                                           
           03  TIME-OUT          PIC 9(8).                                      
           03  DATE-OUT          PIC 9(6).                                      
       01  INPUT-PARM-FLAGS.                                                    
           03  SYS-STAT-FLAG     PIC X.                                         
           03  DB-STAT-FLAG      PIC X.                                         
           03  APP-STAT-FLAG     PIC X.                                         
           03  APP-STAT-NAME     PIC X(8).                                      
       01  CICS-TRAN-TABLE.                                                     
           03  FILLER            PIC X(8) VALUE 'CICSTRAN'.                     
           03  NUM-CICS-TRANS    PIC S9(8) COMP VALUE 0.                        
           03  CICS-TRANS OCCURS 1 TO 300 TIMES                                 
               DEPENDING ON NUM-CICS-TRANS.                                     
               05  T-CODE        PIC X(4).                                      
               05  T-P-NAME      PIC X(8).                                      
               05  FILLER        PIC S9(2) COMP.                                
               05  T-RESTART     PIC S9(2) COMP.                                
               05  T-TOTAL       PIC S9(8) COMP.                                
               05  T-DYNLOC      PIC S9(8) COMP.                                
               05  T-DYNRMT      PIC S9(8) COMP.                                
               05  T-STGVIOL     PIC S9(8) COMP.                                
       LINKAGE SECTION.                                                         
       01  INPUT-PARMS.                                                         
           03  PARM-LENGTH       PIC S9(3) COMP.                                
           03  FILLER            PIC X(9).                                      
           03  SYS-FLAG          PIC X.                                         
           03  FILLER            PIC X(9).                                      
           03  DB-FLAG           PIC X.                                         
           03  FILLER            PIC X(10).                                     
           03  APP-NAME          PIC X(8).                                      
      ****************************************************************          
      *                                                                         
      *    THIS PROGRAM PROCESSES SMF RECORDS PRODUCED BY                       
      *    DB2, FORMATS, AND PRINTS THEIR CONTENT.  AT THIS POINT THE           
      *    ONLY RECORDS IT PROCESSES ARE SYSTEM STATISTICS, DATABASE            
      *    STATISTICS, AND APPLICATION STATISTICS.                              
      *                                                                         
      *    (1)  OPEN OUTPUT FILE                                                
      *                                                                         
      *    (2)  GET TIME CONSTANTS                                              
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      ****************************************************************          
       PROCEDURE DIVISION USING INPUT-PARMS.                                    
       MAIN-ROUTINE.                                                            
      *(1)                                                                      
           OPEN INPUT  INPUT-FILE CONTROL-FILE                                  
                OUTPUT OUTPUT-FILE.                                             
      *(1A)                                                                     
           READ CONTROL-FILE AT END MOVE 'YES' TO CONTROL-FLAG.                 
           MOVE 0 TO NUM-PLANS.                                                 
           PERFORM PLAN-INIT UNTIL                                              
               CONTROL-FLAG = 'YES'                                             
               OR NUM-PLANS > 99.                                               
      *(2)                                                                      
           CALL 'TIMECONS' USING TIME-OF-DAY-CONSTANTS.                         
      *(3)                                                                      
           IF  PARM-LENGTH = 0                                                  
               MOVE 'Y' TO SYS-STAT-FLAG, DB-STAT-FLAG                          
               MOVE 'ALL' TO APP-STAT-NAME                                      
           ELSE                                                                 
               DISPLAY INPUT-PARMS                                              
               MOVE SYS-FLAG TO SYS-STAT-FLAG                                   
               MOVE DB-FLAG TO DB-STAT-FLAG                                     
               MOVE APP-NAME TO APP-STAT-NAME.                                  
           READ INPUT-FILE AT END MOVE 'YES'                                    
           TO EOF-FLAG.                                                         
           PERFORM READ-AND-PRINT UNTIL EOF-FLAG = 'YES'.                       
                                                                                
           MOVE 1 TO S-SUB.                                                     
           PERFORM ACTIVE-THREAD-DISPLAYS                                       
               UNTIL S-SUB > NUM-TRANS.                                         
                                                                                
           IF  NUM-CICS-TRANS > 0                                               
               PERFORM PRINT-CICS-TRANS-HEADER                                  
               MOVE 1 TO S-SUB                                                  
               PERFORM PRINT-CICS-TRANS-DETAIL                                  
                   UNTIL S-SUB > NUM-CICS-TRANS.                                
           PERFORM SYSTEM-STATISTICS.                                           
           PERFORM DB-STATS.                                                    
           CLOSE OUTPUT-FILE INPUT-FILE CONTROL-FILE.                           
           MOVE 0 TO RETURN-CODE.                                               
           GOBACK.                                                              
       READ-AND-PRINT.                                                          
           CALL 'RECTYPE' USING INPUT-RECORD,                                   
                              SMF-FLAG.                                         
           IF  SMF-FLAG = 'SYSTEM'                                              
           CALL 'SYSSTATS' USING SYSTEM-STATS-WORKAREA, INPUT-RECORD            
               IF  SYS-STAT-FLAG = 'Y'                                          
                   PERFORM SYSTEM-STATISTICS                                    
                   DISPLAY 'SYSTEM STATISTICS'                                  
                   DISPLAY SYS-TIME-MOVE, SYS-DATE-MOVE                         
               END-IF                                                           
           ELSE                                                                 
               IF  SMF-FLAG = 'DATABASE'                                        
           CALL 'DBSTATS' USING DB-STATS-WORKAREA, INPUT-RECORD                 
                   IF  DB-STAT-FLAG = 'Y'                                       
                       DISPLAY 'DATABASE STATISTICS'                            
                       PERFORM DB-STATS                                         
                   END-IF                                                       
           ELSE                                                                 
               IF  SMF-FLAG = 'ACCOUNT'                                         
                   IF  APP-STAT-NAME NOT = 'NONE'                               
                       DISPLAY 'ACCOUNTING STATISTICS'                          
                       PERFORM ACTIVE-THREAD-RTN                                
                   END-IF                                                       
           ELSE                                                                 
               IF  SMF-FLAG = 'ZPARM'                                           
               DISPLAY 'START UP PARAMETERS'                                    
           ELSE                                                                 
               IF  SMF-FLAG = 'CICSEOD'                                         
                   PERFORM CICS-STATISTICS                                      
               END-IF                                                           
               END-IF                                                           
               END-IF                                                           
               END-IF                                                           
               END-IF.                                                          
           READ INPUT-FILE  AT END MOVE 'YES'                                   
           TO EOF-FLAG.                                                         
      ******************************************************************        
      *  PLAN-INIT                                                              
      ******************************************************************        
       PLAN-INIT.                                                               
           ADD 1 TO NUM-PLANS.                                                  
           ADD 1 TO NUM-TRANS.                                                  
           MOVE PLAN-IN TO PLAN-NAME(NUM-PLANS).                                
           MOVE NUM-PLANS TO PLAN-NUM(NUM-PLANS).                               
           MOVE PLAN-IN TO PLAN-OUT(NUM-PLANS).                                 
           MOVE 0 TO NUMT(NUM-PLANS).                                           
           MOVE 0 TO  NUMT(NUM-PLANS).                                          
           MOVE 0 TO  ELAPSED(NUM-PLANS).                                       
           MOVE 0 TO  TCB(NUM-PLANS).                                           
           MOVE 0 TO  SRB(NUM-PLANS).                                           
           MOVE 0 TO  LOCKWAIT(NUM-PLANS).                                      
           MOVE 0 TO  IOWAIT(NUM-PLANS).                                        
           MOVE 0 TO  WACN1(NUM-PLANS).                                         
           MOVE 0 TO  WACN2(NUM-PLANS).                                         
           MOVE 0 TO  WACN3(NUM-PLANS).                                         
           MOVE 0 TO  WACN4(NUM-PLANS).                                         
           MOVE 0 TO  WACN5(NUM-PLANS).                                         
           MOVE 0 TO  WACN6(NUM-PLANS).                                         
           MOVE 0 TO  WACN7(NUM-PLANS).                                         
           MOVE 0 TO  XSTN1(NUM-PLANS).                                         
           MOVE 0 TO  XSTN2(NUM-PLANS).                                         
           MOVE 0 TO  XSTN3(NUM-PLANS).                                         
           MOVE 0 TO  XSTN4(NUM-PLANS).                                         
           MOVE 0 TO  XSTN5(NUM-PLANS).                                         
           MOVE 0 TO  XSTN6(NUM-PLANS).                                         
           MOVE 0 TO  XSTN7(NUM-PLANS).                                         
           MOVE 0 TO  XSTN8(NUM-PLANS).                                         
           MOVE 0 TO  XSTN9(NUM-PLANS).                                         
           MOVE 0 TO  XSTN10(NUM-PLANS).                                        
           MOVE 0 TO  XSTN11(NUM-PLANS).                                        
           MOVE 0 TO  XSTN12(NUM-PLANS).                                        
           MOVE 0 TO  XSTN13(NUM-PLANS).                                        
           MOVE 0 TO  XSTN14(NUM-PLANS).                                        
           MOVE 0 TO  XSTN15(NUM-PLANS).                                        
           MOVE 0 TO  XSTN16(NUM-PLANS).                                        
           MOVE 0 TO  XSTN17(NUM-PLANS).                                        
           MOVE 0 TO  XSTN18(NUM-PLANS).                                        
           MOVE 0 TO  XSTN19(NUM-PLANS).                                        
           MOVE 0 TO  XSTN20(NUM-PLANS).                                        
           MOVE 0 TO  XSTN21(NUM-PLANS).                                        
           MOVE 0 TO  XSTN22(NUM-PLANS).                                        
           MOVE 0 TO  XSTN23(NUM-PLANS).                                        
           MOVE 0 TO  XSTN24(NUM-PLANS).                                        
           MOVE 0 TO  XSTN25(NUM-PLANS).                                        
           MOVE 0 TO  XSTN26(NUM-PLANS).                                        
           MOVE 0 TO  XSTN27(NUM-PLANS).                                        
           MOVE 0 TO  XSTN28(NUM-PLANS).                                        
           MOVE 0 TO  XSTN29(NUM-PLANS).                                        
           MOVE 0 TO  XSTN30(NUM-PLANS).                                        
           MOVE 0 TO  XSTN31(NUM-PLANS).                                        
           MOVE 0 TO  XSTN32(NUM-PLANS).                                        
           MOVE 0 TO  XSTN33(NUM-PLANS).                                        
           MOVE 0 TO  XSTN34(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N1(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N2(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N3(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N4(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N5(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N6(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N7(NUM-PLANS).                                        
           MOVE 0 TO  BAC1N8(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N1(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N2(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N3(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N4(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N5(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N6(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N7(NUM-PLANS).                                        
           MOVE 0 TO  BAC2N8(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N1(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N2(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N3(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N4(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N5(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N6(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N7(NUM-PLANS).                                        
           MOVE 0 TO  BAC3N8(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N1(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N2(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N3(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N4(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N5(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N6(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N7(NUM-PLANS).                                        
           MOVE 0 TO  BAC4N8(NUM-PLANS).                                        
           MOVE 0 TO  TXAN1(NUM-PLANS).                                         
           MOVE 0 TO  TXAN2(NUM-PLANS).                                         
           MOVE 0 TO  TXAN3(NUM-PLANS).                                         
           MOVE 0 TO  TXAN4(NUM-PLANS).                                         
           MOVE 0 TO  TXAN5(NUM-PLANS).                                         
           MOVE 0 TO  TXAN6(NUM-PLANS).                                         
           MOVE 0 TO  TXAN7(NUM-PLANS).                                         
           MOVE 0 TO  TXAN9(NUM-PLANS).                                         
           MOVE 0 TO  TXAN10(NUM-PLANS).                                        
           MOVE 0 TO  TXAN11(NUM-PLANS).                                        
           MOVE 0 TO  TXAN12(NUM-PLANS).                                        
           MOVE 0 TO  TXAN13(NUM-PLANS).                                        
           MOVE 0 TO  TXAN14(NUM-PLANS).                                        
           MOVE 0 TO  TXAN15(NUM-PLANS).                                        
           MOVE 0 TO  TXAN16(NUM-PLANS).                                        
           MOVE 0 TO  TXAN17(NUM-PLANS).                                        
           MOVE 0 TO  TXAN18(NUM-PLANS).                                        
           MOVE 0 TO  TXAN19(NUM-PLANS).                                        
           MOVE 0 TO  TXAN20(NUM-PLANS).                                        
           READ CONTROL-FILE AT END MOVE 'YES' TO CONTROL-FLAG.                 
      ******************************************************************        
      *                                                                         
      *    (1)  CALL SYSSTATS                                                   
      *                                                                         
      *    (2)  IF  RETURN CODE NOT = 0                                         
      *                                                                         
      *    (3)      ABEND 100                                                   
      *                                                                         
      *         ENDIF                                                           
      *                                                                         
      *    (4)  MOVE DATA TO OUTPUT RECORDS                                     
      *                                                                         
      *    (5)  CONVERT STCK TIMESTAMP                                          
      *         MOVE TIMESTAMP TO OUTPUT RECORDS                                
      *                                                                         
      *    (6)  WRITE OUTPUT RECORDS                                            
      *                                                                         
      ******************************************************************        
       SYSTEM-STATISTICS.                                                       
      *(1)                                                                      
      *    CALL 'SYSSTATS' USING SYSTEM-STATS-WORKAREA, INPUT-RECORD.           
      *(4)                                                                      
           MOVE CORR QWSA TO OUTPUT-1.                                          
           COMPUTE QWSATCB1-OUT = QWSATCB1 / TIMER-CONSTANT.                    
           COMPUTE QWSASRB1-OUT = QWSASRB1 / TIMER-CONSTANT.                    
           MOVE CORR QWSA TO OUTPUT-2.                                          
           COMPUTE QWSATCB2-OUT = QWSATCB2 / TIMER-CONSTANT.                    
           COMPUTE QWSASRB2-OUT = QWSASRB2 / TIMER-CONSTANT.                    
           MOVE CORR QWSA TO OUTPUT-3.                                          
           COMPUTE QWSATCB3-OUT = QWSATCB3 / TIMER-CONSTANT.                    
           COMPUTE QWSASRB3-OUT = QWSASRB3 / TIMER-CONSTANT.                    
           MOVE CORR Q3ST TO OUTPUT-4.                                          
           MOVE CORR Q3ST TO OUTPUT-5.                                          
           MOVE CORR Q3ST TO OUTPUT-6.                                          
           MOVE CORR Q3ST TO OUTPUT-7.                                          
           MOVE CORR Q9ST TO OUTPUT-8.                                          
           MOVE CORR Q9ST TO OUTPUT-9.                                          
           MOVE CORR Q9ST TO OUTPUT-10.                                         
           MOVE CORR Q9ST TO OUTPUT-11.                                         
           MOVE CORR Q9ST TO OUTPUT-12.                                         
           MOVE CORR QWSD TO OUTPUT-13.                                         
           MOVE CORR QJST TO OUTPUT-14.                                         
           MOVE CORR QJST TO OUTPUT-15.                                         
           MOVE CORR QJST TO OUTPUT-16.                                         
           MOVE CORR QJST TO OUTPUT-17.                                         
           MOVE CORR QVLS TO OUTPUT-1701.                                       
           MOVE CORR QVLS TO OUTPUT-1702.                                       
           MOVE CORR QVLS TO OUTPUT-1703.                                       
           MOVE CORR QVLS TO OUTPUT-1704.                                       
           MOVE CORR QVLS TO OUTPUT-1705.                                       
           MOVE CORR QVLS TO OUTPUT-1706.                                       
           MOVE CORR QVLS TO OUTPUT-1707.                                       
           MOVE CORR QVLS TO OUTPUT-1708.                                       
           MOVE CORR QVAS TO OUTPUT-1709.                                       
           MOVE CORR QVAS TO OUTPUT-1710.                                       
           MOVE CORR QVAS TO OUTPUT-1711.                                       
      *(5)                                                                      
           MOVE SYSTEM-STATS-TIMESTAMP TO TIME-WORK.                            
           PERFORM CONVERT-TIME-STAMP.                                          
           MOVE DATE-STAMP TO SYSTEM-STAT-DATE-OUT.                             
           MOVE TIME-STAMP TO SYSTEM-STAT-TIME-OUT.                             
      *(6)                                                                      
           WRITE OUTPUT-RECORD FROM OUTPUT-00.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-01.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-1.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-2.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-3.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-4.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-5.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-6.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-7.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-8.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-9.                                   
           WRITE OUTPUT-RECORD FROM OUTPUT-10.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-11.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-12.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-13.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-14.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-15.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-16.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-17.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-1701.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1702.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1703.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1704.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1705.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1706.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1707.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1708.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1709.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1710.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-1711.                                
           WRITE OUTPUT-RECORD FROM OUTPUT-ASTERISKS.                           
      ******************************************************************        
      *                                                                         
      *    (1)  CALL DBSTATS                                                    
      *                                                                         
      *    (2)  IF  RETURN CODE NOT = 0                                         
      *                                                                         
      *    (3)      ABEND 200                                                   
      *                                                                         
      *         ENDIF                                                           
      *                                                                         
      *    (4)  MOVE DATA TO OUTPUT RECORDS                                     
      *                                                                         
      *    (5)  CONVERT STCK TIMESTAMP                                          
      *         MOVE TIMESTAMP TO OUTPUT RECORD                                 
      *                                                                         
      *    (6)  WRITE OUTPUT RECORDS                                            
      *                                                                         
      ******************************************************************        
       DB-STATS.                                                                
      *(1)                                                                      
      *    CALL 'DBSTATS' USING DB-STATS-WORKAREA, INPUT-RECORD.                
      *(4)                                                                      
           MOVE CORR QXST TO OUTPUT-20.                                         
           MOVE CORR QXST TO OUTPUT-21.                                         
           MOVE CORR QXST TO OUTPUT-22.                                         
           MOVE CORR QXST TO OUTPUT-23.                                         
           MOVE CORR QXST TO OUTPUT-24.                                         
           MOVE CORR QXST TO OUTPUT-25.                                         
           MOVE CORR QXST TO OUTPUT-26.                                         
           MOVE CORR QXST TO OUTPUT-27.                                         
           MOVE CORR QXST TO OUTPUT-28.                                         
           MOVE CORR QTST TO OUTPUT-29.                                         
           MOVE CORR QTST TO OUTPUT-30.                                         
           MOVE CORR QTST TO OUTPUT-31.                                         
           MOVE CORR QTST TO OUTPUT-32.                                         
           MOVE CORR QTST TO OUTPUT-33.                                         
           MOVE CORR QBST1 TO OUTPUT-34.                                        
           MOVE CORR QBST1 TO OUTPUT-35.                                        
           MOVE CORR QBST1 TO OUTPUT-36.                                        
           MOVE CORR QBST1 TO OUTPUT-37.                                        
           MOVE CORR QBST1 TO OUTPUT-38.                                        
           MOVE CORR QBST1 TO OUTPUT-39.                                        
           MOVE CORR QBST1 TO OUTPUT-40.                                        
           IF  QBST2N1 IN QBST2 NOT = -1                                        
               MOVE CORR QBST2 TO OUTPUT-41                                     
               MOVE CORR QBST2 TO OUTPUT-42                                     
               MOVE CORR QBST2 TO OUTPUT-43                                     
               MOVE CORR QBST2 TO OUTPUT-44                                     
               MOVE CORR QBST2 TO OUTPUT-45                                     
               MOVE CORR QBST2 TO OUTPUT-46                                     
               MOVE CORR QBST2 TO OUTPUT-47.                                    
           IF  QBST3N1 IN QBST3 NOT = -1                                        
               MOVE CORR QBST3 TO OUTPUT-48                                     
               MOVE CORR QBST3 TO OUTPUT-49                                     
               MOVE CORR QBST3 TO OUTPUT-50                                     
               MOVE CORR QBST3 TO OUTPUT-51                                     
               MOVE CORR QBST3 TO OUTPUT-52                                     
               MOVE CORR QBST3 TO OUTPUT-53                                     
               MOVE CORR QBST3 TO OUTPUT-54.                                    
           IF  QBST4N1 IN QBST4 NOT = -1                                        
               MOVE CORR QBST4 TO OUTPUT-55                                     
               MOVE CORR QBST4 TO OUTPUT-56                                     
               MOVE CORR QBST4 TO OUTPUT-57                                     
               MOVE CORR QBST4 TO OUTPUT-58                                     
               MOVE CORR QBST4 TO OUTPUT-59                                     
               MOVE CORR QBST4 TO OUTPUT-60                                     
               MOVE CORR QBST4 TO OUTPUT-61.                                    
           MOVE CORR QTXA TO OUTPUT-62.                                         
           MOVE CORR QTXA TO OUTPUT-63.                                         
           MOVE CORR QTXA TO OUTPUT-64.                                         
           MOVE CORR QTXA TO OUTPUT-65.                                         
           MOVE CORR QTXA TO OUTPUT-66.                                         
           MOVE CORR QISE TO OUTPUT-67.                                         
           MOVE CORR QISE TO OUTPUT-68.                                         
           MOVE CORR QISE TO OUTPUT-69.                                         
      *(5)                                                                      
           MOVE DB-STATS-TIMESTAMP TO TIME-WORK.                                
           PERFORM CONVERT-TIME-STAMP.                                          
           MOVE DATE-STAMP TO DB-STATS-DATE-OUT.                                
           MOVE TIME-STAMP TO DB-STATS-TIME-OUT.                                
      *(6)                                                                      
           WRITE OUTPUT-RECORD FROM OUTPUT-190.                                 
           WRITE OUTPUT-RECORD FROM OUTPUT-191.                                 
           WRITE OUTPUT-RECORD FROM OUTPUT-20.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-21.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-22.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-23.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-24.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-25.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-26.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-27.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-28.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-29.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-30.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-31.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-32.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-33.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-34.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-35.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-36.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-37.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-38.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-39.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-40.                                  
           IF  QBST2N1 IN QBST2 NOT = -1                                        
               WRITE OUTPUT-RECORD FROM OUTPUT-41                               
               WRITE OUTPUT-RECORD FROM OUTPUT-42                               
               WRITE OUTPUT-RECORD FROM OUTPUT-43                               
               WRITE OUTPUT-RECORD FROM OUTPUT-44                               
               WRITE OUTPUT-RECORD FROM OUTPUT-45                               
               WRITE OUTPUT-RECORD FROM OUTPUT-46                               
               WRITE OUTPUT-RECORD FROM OUTPUT-47.                              
           IF  QBST3N1 IN QBST3 NOT = -1                                        
               WRITE OUTPUT-RECORD FROM OUTPUT-48                               
               WRITE OUTPUT-RECORD FROM OUTPUT-49                               
               WRITE OUTPUT-RECORD FROM OUTPUT-50                               
               WRITE OUTPUT-RECORD FROM OUTPUT-51                               
               WRITE OUTPUT-RECORD FROM OUTPUT-52                               
               WRITE OUTPUT-RECORD FROM OUTPUT-53                               
               WRITE OUTPUT-RECORD FROM OUTPUT-54.                              
           IF  QBST4N1 IN QBST4 NOT = -1                                        
               WRITE OUTPUT-RECORD FROM OUTPUT-55                               
               WRITE OUTPUT-RECORD FROM OUTPUT-56                               
               WRITE OUTPUT-RECORD FROM OUTPUT-57                               
               WRITE OUTPUT-RECORD FROM OUTPUT-58                               
               WRITE OUTPUT-RECORD FROM OUTPUT-59                               
               WRITE OUTPUT-RECORD FROM OUTPUT-60                               
               WRITE OUTPUT-RECORD FROM OUTPUT-61.                              
           WRITE OUTPUT-RECORD FROM OUTPUT-62.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-63.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-64.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-65.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-66.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-67.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-68.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-69.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-ASTERISKS.                           
      ******************************************************************        
      *                                                                         
      *    (1)  CALL DISTHRED TO ISSUE -DIS THREAD(*) COMMAND                   
      *                                                                         
      *    (2)  IF  IT DIDN'T WORK                                              
      *                                                                         
      *    (3)      ABEND 300                                                   
      *                                                                         
      *         ENDIF                                                           
      *                                                                         
      *    (4)  DO WHILE THERE ARE THREADS TO PROCESS                           
      *                                                                         
      *    (5)      WRITE THREAD HEADER                                         
      *                                                                         
      *    (6)      ATTEMPT TO RETRIEVE THREAD DETAILS                          
      *                                                                         
      *    (7)      IF  IT WORKED                                               
      *                                                                         
      *    (8)          CONVERT AND DISPLAY DATA                                
      *                                                                         
      *             ELSE                                                        
      *                                                                         
      *    (9)          IF  THREAD TERMINATED                                   
      *                                                                         
      *    (10)             DISPLAY TERMINATED MESSAGE                          
      *                                                                         
      *                 ELSE                                                    
      *                                                                         
      *    (11)             ABEND 400                                           
      *                                                                         
      *                 ENDIF                                                   
      *                                                                         
      *             ENDIF                                                       
      *                                                                         
      *         ENDDO                                                           
      *                                                                         
      ******************************************************************        
       ACTIVE-THREAD-RTN.                                                       
      *(6)                                                                      
           CALL 'APPSTATS' USING THREAD-DETAIL, INPUT-RECORD.                   
           MOVE 'NO' TO SEARCH-FLAG.                                            
           SET PLAN-INDEX TO 1.                                                 
           SEARCH PLANS                                                         
               AT END MOVE 'NO' TO SEARCH-FLAG                                  
               WHEN ACORRN4 IN ACORR = PLAN-NAME(PLAN-INDEX)                    
                    MOVE 'YES' TO SEARCH-FLAG                                   
                    MOVE PLAN-NUM(PLAN-INDEX) TO S-SUB-SAVE.                    
      *( )                                                                      
           IF  SEARCH-FLAG = 'NO'                                               
               DISPLAY ACORRN4 IN ACORR ' *** NOT FOUND ***'                    
           ELSE                                                                 
               PERFORM TRAN-SAVE-DATA.                                          
      ******************************************************************        
      *                                                                         
      ******************************************************************        
       TRAN-SAVE-DATA.                                                          
           COMPUTE TIME-WORK = END-TIME-STAMP - BEG-TIME-STAMP.                 
           COMPUTE APPL-ELAPSED-WORK   = TIME-WORK / 1-SECOND.                  
           COMPUTE APPL-TCB-WORK       = AWACN2 / TIMER-CONSTANT.               
           COMPUTE APPL-SRB-WORK       = AWACN3 / TIMER-CONSTANT.               
           COMPUTE APPL-IOWAIT-WORK    = AWACN4 / TIMER-CONSTANT.               
           COMPUTE APPL-LOCKWAIT-WORK  = AWACN5 / TIMER-CONSTANT.               
           ADD 1 TO NUMT(S-SUB-SAVE).                                           
           ADD APPL-ELAPSED-WORK TO ELAPSED(S-SUB-SAVE).                        
           ADD APPL-TCB-WORK TO TCB(S-SUB-SAVE).                                
           ADD APPL-SRB-WORK TO SRB(S-SUB-SAVE).                                
           ADD APPL-IOWAIT-WORK TO IOWAIT(S-SUB-SAVE).                          
           ADD APPL-LOCKWAIT-WORK TO LOCKWAIT(S-SUB-SAVE).                      
                                                                                
           ADD AWACN1 IN AWAC TO WACN1(S-SUB-SAVE).                             
           ADD AWACN2 IN AWAC TO WACN2(S-SUB-SAVE).                             
           ADD AWACN3 IN AWAC TO WACN3(S-SUB-SAVE).                             
           ADD AWACN4 IN AWAC TO WACN4(S-SUB-SAVE).                             
           ADD AWACN5 IN AWAC TO WACN5(S-SUB-SAVE).                             
           ADD AWACN6 IN AWAC TO WACN6(S-SUB-SAVE).                             
           ADD AWACN7 IN AWAC TO WACN7(S-SUB-SAVE).                             
                                                                                
           IF  AXSTN1 IN AXST NOT = -1                                          
               ADD AXSTN1 IN AXST TO XSTN1(S-SUB-SAVE)                          
               ADD AXSTN2 IN AXST TO XSTN2(S-SUB-SAVE)                          
               ADD AXSTN3 IN AXST TO XSTN3(S-SUB-SAVE)                          
               ADD AXSTN4 IN AXST TO XSTN4(S-SUB-SAVE)                          
               ADD AXSTN5 IN AXST TO XSTN5(S-SUB-SAVE)                          
               ADD AXSTN6 IN AXST TO XSTN6(S-SUB-SAVE)                          
               ADD AXSTN7 IN AXST TO XSTN7(S-SUB-SAVE)                          
               ADD AXSTN8 IN AXST TO XSTN8(S-SUB-SAVE)                          
               ADD AXSTN9 IN AXST TO XSTN9(S-SUB-SAVE)                          
               ADD AXSTN10 IN AXST TO XSTN10(S-SUB-SAVE)                        
               ADD AXSTN11 IN AXST TO XSTN11(S-SUB-SAVE)                        
               ADD AXSTN12 IN AXST TO XSTN12(S-SUB-SAVE)                        
               ADD AXSTN13 IN AXST TO XSTN13(S-SUB-SAVE)                        
               ADD AXSTN14 IN AXST TO XSTN14(S-SUB-SAVE)                        
               ADD AXSTN15 IN AXST TO XSTN15(S-SUB-SAVE)                        
               ADD AXSTN16 IN AXST TO XSTN16(S-SUB-SAVE)                        
               ADD AXSTN17 IN AXST TO XSTN17(S-SUB-SAVE)                        
               ADD AXSTN18 IN AXST TO XSTN18(S-SUB-SAVE)                        
               ADD AXSTN19 IN AXST TO XSTN19(S-SUB-SAVE)                        
               ADD AXSTN20 IN AXST TO XSTN20(S-SUB-SAVE)                        
               ADD AXSTN21 IN AXST TO XSTN21(S-SUB-SAVE)                        
               ADD AXSTN22 IN AXST TO XSTN22(S-SUB-SAVE)                        
               ADD AXSTN23 IN AXST TO XSTN23(S-SUB-SAVE)                        
               ADD AXSTN24 IN AXST TO XSTN24(S-SUB-SAVE)                        
               ADD AXSTN25 IN AXST TO XSTN25(S-SUB-SAVE)                        
               ADD AXSTN26 IN AXST TO XSTN26(S-SUB-SAVE)                        
               ADD AXSTN27 IN AXST TO XSTN27(S-SUB-SAVE)                        
               ADD AXSTN28 IN AXST TO XSTN28(S-SUB-SAVE)                        
               ADD AXSTN29 IN AXST TO XSTN29(S-SUB-SAVE)                        
               ADD AXSTN30 IN AXST TO XSTN30(S-SUB-SAVE)                        
               ADD AXSTN31 IN AXST TO XSTN31(S-SUB-SAVE)                        
               ADD AXSTN32 IN AXST TO XSTN32(S-SUB-SAVE)                        
               ADD AXSTN33 IN AXST TO XSTN33(S-SUB-SAVE)                        
               ADD AXSTN34 IN AXST TO XSTN34(S-SUB-SAVE).                       
      *                                                                         
           IF  ABAC1N1 IN ABAC NOT = -1                                         
               ADD ABAC1N2 IN ABAC TO BAC1N2(S-SUB-SAVE)                        
               ADD ABAC1N3 IN ABAC TO BAC1N3(S-SUB-SAVE)                        
               ADD ABAC1N4 IN ABAC TO BAC1N4(S-SUB-SAVE)                        
               ADD ABAC1N5 IN ABAC TO BAC1N5(S-SUB-SAVE)                        
               ADD ABAC1N6 IN ABAC TO BAC1N6(S-SUB-SAVE)                        
               ADD ABAC1N7 IN ABAC TO BAC1N7(S-SUB-SAVE)                        
               ADD ABAC1N8 IN ABAC TO BAC1N8(S-SUB-SAVE).                       
      *                                                                         
           IF  ABAC2N1 IN ABAC NOT = -1                                         
               ADD ABAC2N2 IN ABAC TO BAC2N2(S-SUB-SAVE)                        
               ADD ABAC2N3 IN ABAC TO BAC2N3(S-SUB-SAVE)                        
               ADD ABAC2N4 IN ABAC TO BAC2N4(S-SUB-SAVE)                        
               ADD ABAC2N5 IN ABAC TO BAC2N5(S-SUB-SAVE)                        
               ADD ABAC2N6 IN ABAC TO BAC2N6(S-SUB-SAVE)                        
               ADD ABAC2N7 IN ABAC TO BAC2N7(S-SUB-SAVE)                        
               ADD ABAC2N8 IN ABAC TO BAC2N8(S-SUB-SAVE).                       
      *                                                                         
           IF  ABAC3N1 IN ABAC NOT = -1                                         
               ADD ABAC3N2 IN ABAC TO BAC3N2(S-SUB-SAVE)                        
               ADD ABAC3N3 IN ABAC TO BAC3N3(S-SUB-SAVE)                        
               ADD ABAC3N4 IN ABAC TO BAC3N4(S-SUB-SAVE)                        
               ADD ABAC3N5 IN ABAC TO BAC3N5(S-SUB-SAVE)                        
               ADD ABAC3N6 IN ABAC TO BAC3N6(S-SUB-SAVE)                        
               ADD ABAC3N7 IN ABAC TO BAC3N7(S-SUB-SAVE)                        
               ADD ABAC3N8 IN ABAC TO BAC3N8(S-SUB-SAVE).                       
      *                                                                         
           IF  ABAC4N1 IN ABAC NOT = -1                                         
               ADD ABAC4N2 IN ABAC TO BAC4N2(S-SUB-SAVE)                        
               ADD ABAC4N3 IN ABAC TO BAC4N3(S-SUB-SAVE)                        
               ADD ABAC4N4 IN ABAC TO BAC4N4(S-SUB-SAVE)                        
               ADD ABAC4N5 IN ABAC TO BAC4N5(S-SUB-SAVE)                        
               ADD ABAC4N6 IN ABAC TO BAC4N6(S-SUB-SAVE)                        
               ADD ABAC4N7 IN ABAC TO BAC4N7(S-SUB-SAVE)                        
               ADD ABAC4N8 IN ABAC TO BAC4N8(S-SUB-SAVE).                       
      *                                                                         
           IF  ATXAN1 IN ATXA NOT = -1                                          
               ADD ATXAN1 IN ATXA TO TXAN1(S-SUB-SAVE)                          
               ADD ATXAN2 IN ATXA TO TXAN2(S-SUB-SAVE)                          
               ADD ATXAN3 IN ATXA TO TXAN3(S-SUB-SAVE)                          
               ADD ATXAN4 IN ATXA TO TXAN4(S-SUB-SAVE)                          
               ADD ATXAN5 IN ATXA TO TXAN5(S-SUB-SAVE)                          
               ADD ATXAN6 IN ATXA TO TXAN6(S-SUB-SAVE)                          
      *        ADD ATXAN7 IN ATXA TO TXAN7(S-SUB-SAVE)                          
      *        ADD ATXAN8 IN ATXA TO TXAN8(S-SUB-SAVE)                          
      *        ADD ATXAN9 IN ATXA TO TXAN9(S-SUB-SAVE)                          
               ADD ATXAN10 IN ATXA TO TXAN10(S-SUB-SAVE)                        
               ADD ATXAN11 IN ATXA TO TXAN11(S-SUB-SAVE)                        
               ADD ATXAN12 IN ATXA TO TXAN12(S-SUB-SAVE)                        
               ADD ATXAN13 IN ATXA TO TXAN13(S-SUB-SAVE)                        
               ADD ATXAN14 IN ATXA TO TXAN14(S-SUB-SAVE)                        
               ADD ATXAN15 IN ATXA TO TXAN15(S-SUB-SAVE)                        
               ADD ATXAN16 IN ATXA TO TXAN16(S-SUB-SAVE)                        
               ADD ATXAN17 IN ATXA TO TXAN17(S-SUB-SAVE)                        
               ADD ATXAN18 IN ATXA TO TXAN18(S-SUB-SAVE)                        
               ADD ATXAN19 IN ATXA TO TXAN19(S-SUB-SAVE)                        
               ADD ATXAN20 IN ATXA TO TXAN20(S-SUB-SAVE).                       
      *                                                                         
      ******************************************************************        
      *                                                                         
      ******************************************************************        
       ACTIVE-THREAD-DISPLAYS.                                                  
           IF  NUMT(S-SUB) > 0                                                  
               PERFORM ACTIVE-THREAD-COMPUTE                                    
           ELSE                                                                 
               DISPLAY PLAN-OUT(S-SUB) 'HAS NO BANANAS TODAY'                   
               ADD 1 TO S-SUB.                                                  
       ACTIVE-THREAD-COMPUTE.                                                   
           DISPLAY S-SUB NUM-TRANS 'A001'.                                      
      *(1)                                                                      
           COMPUTE TIME-WORK = END-TIME-STAMP - BEG-TIME-STAMP.                 
           COMPUTE APPL-ELAPSED  = ELAPSED(S-SUB) / NUMT(S-SUB).                
           COMPUTE APPL-TCB      = TCB(S-SUB)     / NUMT(S-SUB).                
           COMPUTE APPL-SRB      = SRB(S-SUB) / NUMT(S-SUB).                    
           COMPUTE APPL-IOWAIT   = IOWAIT(S-SUB) / NUMT(S-SUB).                 
           COMPUTE APPL-LOCKWAIT = LOCKWAIT(S-SUB) / NUMT(S-SUB).               
      *(2)                                                                      
           MOVE NUMT(S-SUB)     TO NUMT-OUT.                                    
           MOVE PLAN-OUT(S-SUB) TO ACORRN4 IN OUTPUT-71.                        
      *                                                                         
           COMPUTE AWACN6 IN OUTPUT-74 = WACN6(S-SUB) / NUMT(S-SUB).            
           COMPUTE AWACN7 IN OUTPUT-74 = WACN7(S-SUB) / NUMT(S-SUB).            
      *                                                                         
           COMPUTE AXSTN1 IN OUTPUT-75 = XSTN1(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN2 IN OUTPUT-75 = XSTN2(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN3 IN OUTPUT-75 = XSTN3(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN4 IN OUTPUT-75 = XSTN4(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN5 IN OUTPUT-76 = XSTN5(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN6 IN OUTPUT-76 = XSTN6(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN7 IN OUTPUT-76 = XSTN7(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN8 IN OUTPUT-76 = XSTN8(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN9 IN OUTPUT-77 = XSTN9(S-SUB) / NUMT(S-SUB).            
           COMPUTE AXSTN10 IN OUTPUT-77 = XSTN10(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN11 IN OUTPUT-77 = XSTN11(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN12 IN OUTPUT-77 = XSTN12(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN13 IN OUTPUT-78 = XSTN13(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN14 IN OUTPUT-78 = XSTN14(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN15 IN OUTPUT-78 = XSTN15(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN16 IN OUTPUT-78 = XSTN16(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN17 IN OUTPUT-79 = XSTN17(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN18 IN OUTPUT-79 = XSTN18(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN19 IN OUTPUT-79 = XSTN19(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN20 IN OUTPUT-79 = XSTN20(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN21 IN OUTPUT-80 = XSTN21(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN22 IN OUTPUT-80 = XSTN22(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN23 IN OUTPUT-80 = XSTN23(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN24 IN OUTPUT-80 = XSTN24(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN25 IN OUTPUT-81 = XSTN25(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN26 IN OUTPUT-81 = XSTN26(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN27 IN OUTPUT-81 = XSTN27(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN28 IN OUTPUT-81 = XSTN28(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN29 IN OUTPUT-82 = XSTN29(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN30 IN OUTPUT-82 = XSTN30(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN31 IN OUTPUT-82 = XSTN31(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN32 IN OUTPUT-82 = XSTN32(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN33 IN OUTPUT-83 = XSTN33(S-SUB) / NUMT(S-SUB).          
           COMPUTE AXSTN34 IN OUTPUT-83 = XSTN34(S-SUB) / NUMT(S-SUB).          
      *                                                                         
           MOVE BAC1N1(S-SUB) TO ABAC1N1 IN OUTPUT-84.                          
           COMPUTE ABAC1N2 IN OUTPUT-84 = BAC1N2(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC1N3 IN OUTPUT-84 = BAC1N3(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC1N4 IN OUTPUT-84 = BAC1N4(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC1N5 IN OUTPUT-85 = BAC1N5(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC1N6 IN OUTPUT-85 = BAC1N6(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC1N7 IN OUTPUT-85 = BAC1N7(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC1N8 IN OUTPUT-85 = BAC1N8(S-SUB) / NUMT(S-SUB).          
      *                                                                         
           MOVE BAC2N1(S-SUB) TO ABAC2N1 IN OUTPUT-86.                          
           COMPUTE ABAC2N2 IN OUTPUT-86 = BAC2N2(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC2N3 IN OUTPUT-86 = BAC2N3(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC2N4 IN OUTPUT-86 = BAC2N4(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC2N5 IN OUTPUT-87 = BAC2N5(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC2N6 IN OUTPUT-87 = BAC2N6(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC2N7 IN OUTPUT-87 = BAC2N7(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC2N8 IN OUTPUT-87 = BAC2N8(S-SUB) / NUMT(S-SUB).          
      *                                                                         
           MOVE BAC3N1(S-SUB) TO ABAC3N1 IN OUTPUT-88.                          
           COMPUTE ABAC3N2 IN OUTPUT-88 = BAC3N2(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC3N3 IN OUTPUT-88 = BAC3N3(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC3N4 IN OUTPUT-88 = BAC3N4(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC3N5 IN OUTPUT-89 = BAC3N5(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC3N6 IN OUTPUT-89 = BAC3N6(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC3N7 IN OUTPUT-89 = BAC3N7(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC3N8 IN OUTPUT-89 = BAC3N8(S-SUB) / NUMT(S-SUB).          
      *                                                                         
           MOVE BAC4N1(S-SUB) TO ABAC4N1 IN OUTPUT-90.                          
           COMPUTE ABAC4N2 IN OUTPUT-90 = BAC4N2(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC4N3 IN OUTPUT-90 = BAC4N3(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC4N4 IN OUTPUT-90 = BAC4N4(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC4N5 IN OUTPUT-91 = BAC4N5(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC4N6 IN OUTPUT-91 = BAC4N6(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC4N7 IN OUTPUT-91 = BAC4N7(S-SUB) / NUMT(S-SUB).          
           COMPUTE ABAC4N8 IN OUTPUT-91 = BAC4N8(S-SUB) / NUMT(S-SUB).          
      *                                                                         
           COMPUTE ATXAN1  IN OUTPUT-92 = TXAN1(S-SUB) / NUMT(S-SUB).           
           COMPUTE ATXAN2  IN OUTPUT-92 = TXAN2(S-SUB) / NUMT(S-SUB).           
           COMPUTE ATXAN3  IN OUTPUT-92 = TXAN3(S-SUB) / NUMT(S-SUB).           
           COMPUTE ATXAN4  IN OUTPUT-92 = TXAN4(S-SUB) / NUMT(S-SUB).           
           COMPUTE ATXAN5  IN OUTPUT-93 = TXAN5(S-SUB) / NUMT(S-SUB).           
           COMPUTE ATXAN6  IN OUTPUT-93 = TXAN6(S-SUB) / NUMT(S-SUB).           
           COMPUTE ATXAN10 IN OUTPUT-94 = TXAN10(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN11 IN OUTPUT-94 = TXAN11(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN12 IN OUTPUT-94 = TXAN12(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN13 IN OUTPUT-94 = TXAN13(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN14 IN OUTPUT-95 = TXAN14(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN15 IN OUTPUT-95 = TXAN15(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN16 IN OUTPUT-95 = TXAN16(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN17 IN OUTPUT-95 = TXAN17(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN18 IN OUTPUT-96 = TXAN18(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN19 IN OUTPUT-96 = TXAN19(S-SUB) / NUMT(S-SUB).          
           COMPUTE ATXAN20 IN OUTPUT-96 = TXAN20(S-SUB) / NUMT(S-SUB).          
      *(3)                                                                      
           WRITE OUTPUT-RECORD FROM OUTPUT-700.                                 
           WRITE OUTPUT-RECORD FROM OUTPUT-701.                                 
           WRITE OUTPUT-RECORD FROM OUTPUT-71.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-72.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-73.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-74.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-75.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-76.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-77.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-78.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-79.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-80.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-81.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-82.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-83.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-84.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-85.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-86.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-87.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-88.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-89.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-90.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-91.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-92.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-93.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-94.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-95.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-96.                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-ASTERISKS.                           
           ADD 1 TO S-SUB.                                                      
      ******************************************************************        
      *                                                                         
      *    NOTE - THIS ROUTINE RETURNS GREENWICH MEAN TIME, WHICH IS            
      *           NOT NECESSARILY LOCAL TIME.  THIS IS A STCK                   
      *           LIMITATION (FEATURE?)                                         
      *                                                                         
      *                                                                         
      *    (1)  INITIALIZE BASE DATE TO 00.00 HOURS, JANUARY 1, 1988            
      *                                                                         
      *    (2)  COMPUTE TIME BETWEEN NOW AND BASE DATE                          
      *                                                                         
      *    (3)  COMPUTE # YEARS BETWEEN BASE DATE AND NOW                       
      *                                                                         
      *    (4)  ADD # YEARS TO BASE                                             
      *                                                                         
      *    (5)  COMPUTE JULIAN DAY OF YEAR                                      
      *                                                                         
      *    (6)  COMPUTE HOURS AND MINUTES                                       
      *                                                                         
      *    (7)  COMPUTE SECONDS                                                 
      *                                                                         
      ******************************************************************        
       CONVERT-TIME-STAMP.                                                      
      *(1)                                                                      
           MOVE 1988 TO YEAR.                                                   
      *(2)                                                                      
           SUBTRACT 1988-YEAR FROM TIME-WORK GIVING TIME-WORK-1.                
      *(3)                                                                      
           DIVIDE TIME-WORK-1 BY 1461-DAYS GIVING TIME-WORK-2                   
               REMAINDER TIME-WORK-3.                                           
           IF  TIME-WORK-2 > 0                                                  
               COMPUTE YEAR = (YEAR + (4 * TIME-WORK-2)).                       
           DIVIDE TIME-WORK-3 BY 365-DAYS GIVING TIME-WORK-4                    
               REMAINDER TIME-WORK-5.                                           
      *(4)                                                                      
           IF TIME-WORK-4 > 0                                                   
               COMPUTE YEAR = YEAR + TIME-WORK-4.                               
      *(5)                                                                      
           DIVIDE TIME-WORK-5 BY 1-DAY GIVING TIME-WORK-6                       
               REMAINDER TIME-WORK-7.                                           
           MOVE TIME-WORK-6 TO DAYS.                                            
      *(6)                                                                      
           DIVIDE TIME-WORK-7 BY 1-MINUTE GIVING TIME-WORK-8                    
               REMAINDER TIME-WORK-9.                                           
           DIVIDE TIME-WORK-8 BY 60 GIVING HOURS                                
               REMAINDER MINUTES.                                               
      *(7)                                                                      
           DIVIDE TIME-WORK-9 BY 1-SECOND GIVING SECONDS.                       
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
      *                                                                         
       CICS-STATISTICS.                                                         
           CALL  'SMF110' USING INPUT-RECORD,                                   
                                CICS-TRAN-TABLE.                                
                                                                                
       PRINT-CICS-TRANS-HEADER.                                                 
           WRITE OUTPUT-RECORD FROM OUTPUT-100.                                 
           WRITE OUTPUT-RECORD FROM OUTPUT-101.                                 
                                                                                
       PRINT-CICS-TRANS-DETAIL.                                                 
           MOVE CORRESPONDING CICS-TRANS(S-SUB)                                 
                TO OUTPUT-102.                                                  
           WRITE OUTPUT-RECORD FROM OUTPUT-102.                                 
           ADD 1 TO S-SUB.                                                      
