//DEFTOR3  JOB  (85012,MS75),'SPETH',MSGCLASS=X                                 
//VTAMDEF  EXEC  PGM=DFHCSDUP                                                   
//STEPLIB  DD  DSN=CICS321.SDFHLOAD,DISP=SHR                                    
//DFHCSD  DD  DSN=CICS321.DFHCSD,DISP=SHR                                       
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN  DD  *                                                                  
DELETE GROUP(CRTS)                                                              
DELETE GROUP(MROTA01)                                                           
DELETE GROUP(OLDCICS)                                                           
DELETE LIST(TLIST)                                                              
DEFINE TYPETERM(3180S)     GROUP(CRTS)          DEVICE(3270)                    
       DEFSCREEN(24,80)    ALTSCREEN(32,80)     BUILDCHAIN(NO)                  
       BRACKET(YES)        SENDSIZE(1920)       AUDIBLEALARM(YES)               
       DUALCASEKYBD(YES)   UCTRAN(YES)          COLOR(NO)                       
       EXTENDEDDS(NO)      HILIGHT(NO)          LIGHTPEN(NO)                    
       ERRLASTLINE(NO)     ERRINTENSIFY(NO)     ERRCOLOR(NO)                    
       ERRHILIGHT(NO)      AUTOCONNECT(YES)     ATI(YES)                        
       TTI(YES)            LOGONMSG(YES)        RELREQ(YES)                     
       SIGNOFF(YES)        RECEIVESIZE(1920)    IOAREALEN(2000,4000)            
       TERMMODEL(2)        DESCRIPTION(ATTRIBUTES FOR 3278 MODEL 2)             
       SHIPPABLE(YES)                                                           
*                                                                               
DEFINE TYPETERM(LU2)       GROUP(CRTS)          DEVICE(LUTYPE2)                 
       DEFSCREEN(24,80)    ALTSCREEN(32,80)     BUILDCHAIN(NO)                  
       BRACKET(YES)        SENDSIZE(1536)       AUDIBLEALARM(YES)               
       DUALCASEKYBD(YES)   UCTRAN(YES)          COLOR(NO)                       
       EXTENDEDDS(NO)      HILIGHT(NO)          LIGHTPEN(NO)                    
       ERRLASTLINE(NO)     ERRINTENSIFY(NO)     ERRCOLOR(NO)                    
       ERRHILIGHT(NO)      AUTOCONNECT(YES)     ATI(YES)                        
       TTI(YES)            LOGONMSG(YES)        RELREQ(YES)                     
       SIGNOFF(YES)        RECEIVESIZE(256)    IOAREALEN(256,4000)              
       TERMMODEL(2)        DESCRIPTION(ATTRIBUTES FOR 3278 MODEL 2)             
       SHIPPABLE(YES)                                                           
*                                                                               
DEFINE TERMINAL(C020)    NETNAME(HM31T020)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(C021)    NETNAME(HM31T021)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(C022)    NETNAME(HM31T022)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(C023)    NETNAME(HM31T023)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(C02E)    NETNAME(HM31T02E)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(C02F)    NETNAME(HM31T02F)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(C030)    NETNAME(HM31T030)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(C041)    NETNAME(HM31T041)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES)                                      
*                                                                               
DEFINE TERMINAL(0000)    NETNAME(TPNS0000)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0001)    NETNAME(TPNS0001)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0002)    NETNAME(TPNS0002)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0003)    NETNAME(TPNS0003)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0004)    NETNAME(TPNS0004)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0005)    NETNAME(TPNS0005)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0006)    NETNAME(TPNS0006)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0007)    NETNAME(TPNS0007)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0008)    NETNAME(TPNS0008)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0009)    NETNAME(TPNS0009)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0010)    NETNAME(TPNS0010)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0011)    NETNAME(TPNS0011)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0012)    NETNAME(TPNS0012)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0013)    NETNAME(TPNS0013)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0014)    NETNAME(TPNS0014)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0015)    NETNAME(TPNS0015)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0016)    NETNAME(TPNS0016)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0017)    NETNAME(TPNS0017)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0018)    NETNAME(TPNS0018)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0019)    NETNAME(TPNS0019)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0020)    NETNAME(TPNS0020)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0021)    NETNAME(TPNS0021)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0022)    NETNAME(TPNS0022)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0023)    NETNAME(TPNS0023)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0024)    NETNAME(TPNS0024)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0025)    NETNAME(TPNS0025)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0026)    NETNAME(TPNS0026)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0027)    NETNAME(TPNS0027)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0028)    NETNAME(TPNS0028)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0029)    NETNAME(TPNS0029)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0030)    NETNAME(TPNS0030)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0031)    NETNAME(TPNS0031)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0032)    NETNAME(TPNS0032)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0033)    NETNAME(TPNS0033)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0034)    NETNAME(TPNS0034)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0035)    NETNAME(TPNS0035)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0036)    NETNAME(TPNS0036)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0037)    NETNAME(TPNS0037)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0038)    NETNAME(TPNS0038)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0039)    NETNAME(TPNS0039)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0040)    NETNAME(TPNS0040)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0041)    NETNAME(TPNS0041)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0042)    NETNAME(TPNS0042)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0043)    NETNAME(TPNS0043)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0044)    NETNAME(TPNS0044)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0045)    NETNAME(TPNS0045)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0046)    NETNAME(TPNS0046)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0047)    NETNAME(TPNS0047)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0048)    NETNAME(TPNS0048)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0049)    NETNAME(TPNS0049)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0050)    NETNAME(TPNS0050)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0051)    NETNAME(TPNS0051)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0052)    NETNAME(TPNS0052)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0053)    NETNAME(TPNS0053)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0054)    NETNAME(TPNS0054)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0055)    NETNAME(TPNS0055)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0056)    NETNAME(TPNS0056)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0057)    NETNAME(TPNS0057)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0058)    NETNAME(TPNS0058)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0059)    NETNAME(TPNS0059)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0060)    NETNAME(TPNS0060)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0061)    NETNAME(TPNS0061)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0062)    NETNAME(TPNS0062)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0063)    NETNAME(TPNS0063)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0064)    NETNAME(TPNS0064)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0065)    NETNAME(TPNS0065)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0066)    NETNAME(TPNS0066)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0067)    NETNAME(TPNS0067)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0068)    NETNAME(TPNS0068)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0069)    NETNAME(TPNS0069)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0070)    NETNAME(TPNS0070)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0071)    NETNAME(TPNS0071)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0072)    NETNAME(TPNS0072)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0073)    NETNAME(TPNS0073)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0074)    NETNAME(TPNS0074)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0075)    NETNAME(TPNS0075)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0076)    NETNAME(TPNS0076)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0077)    NETNAME(TPNS0077)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0078)    NETNAME(TPNS0078)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0079)    NETNAME(TPNS0079)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0080)    NETNAME(TPNS0080)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0081)    NETNAME(TPNS0081)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0082)    NETNAME(TPNS0082)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0083)    NETNAME(TPNS0083)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0084)    NETNAME(TPNS0084)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0085)    NETNAME(TPNS0085)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0086)    NETNAME(TPNS0086)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0087)    NETNAME(TPNS0087)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0088)    NETNAME(TPNS0088)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0089)    NETNAME(TPNS0089)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0090)    NETNAME(TPNS0090)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0091)    NETNAME(TPNS0091)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0092)    NETNAME(TPNS0092)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0093)    NETNAME(TPNS0093)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0094)    NETNAME(TPNS0094)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0095)    NETNAME(TPNS0095)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0096)    NETNAME(TPNS0096)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0097)    NETNAME(TPNS0097)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0098)    NETNAME(TPNS0098)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0099)    NETNAME(TPNS0099)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0100)    NETNAME(TPNS0100)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0101)    NETNAME(TPNS0101)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0102)    NETNAME(TPNS0102)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0103)    NETNAME(TPNS0103)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0104)    NETNAME(TPNS0104)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0105)    NETNAME(TPNS0105)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0106)    NETNAME(TPNS0106)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0107)    NETNAME(TPNS0107)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0108)    NETNAME(TPNS0108)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0109)    NETNAME(TPNS0109)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0110)    NETNAME(TPNS0110)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0111)    NETNAME(TPNS0111)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0112)    NETNAME(TPNS0112)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0113)    NETNAME(TPNS0113)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0114)    NETNAME(TPNS0114)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0115)    NETNAME(TPNS0115)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0116)    NETNAME(TPNS0116)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0117)    NETNAME(TPNS0117)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0118)    NETNAME(TPNS0118)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0119)    NETNAME(TPNS0119)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0120)    NETNAME(TPNS0120)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0121)    NETNAME(TPNS0121)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0122)    NETNAME(TPNS0122)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0123)    NETNAME(TPNS0123)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0124)    NETNAME(TPNS0124)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0125)    NETNAME(TPNS0125)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0126)    NETNAME(TPNS0126)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0127)    NETNAME(TPNS0127)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0128)    NETNAME(TPNS0128)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0129)    NETNAME(TPNS0129)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0130)    NETNAME(TPNS0130)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0131)    NETNAME(TPNS0131)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0132)    NETNAME(TPNS0132)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0133)    NETNAME(TPNS0133)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0134)    NETNAME(TPNS0134)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0135)    NETNAME(TPNS0135)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0136)    NETNAME(TPNS0136)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0137)    NETNAME(TPNS0137)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0138)    NETNAME(TPNS0138)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0139)    NETNAME(TPNS0139)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0140)    NETNAME(TPNS0140)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0141)    NETNAME(TPNS0141)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0142)    NETNAME(TPNS0142)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0143)    NETNAME(TPNS0143)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0144)    NETNAME(TPNS0144)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0145)    NETNAME(TPNS0145)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0146)    NETNAME(TPNS0146)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0147)    NETNAME(TPNS0147)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0148)    NETNAME(TPNS0148)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0149)    NETNAME(TPNS0149)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0150)    NETNAME(TPNS0150)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0151)    NETNAME(TPNS0151)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0152)    NETNAME(TPNS0152)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0153)    NETNAME(TPNS0153)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0154)    NETNAME(TPNS0154)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0155)    NETNAME(TPNS0155)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0156)    NETNAME(TPNS0156)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0157)    NETNAME(TPNS0157)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0158)    NETNAME(TPNS0158)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0159)    NETNAME(TPNS0159)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0160)    NETNAME(TPNS0160)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0161)    NETNAME(TPNS0161)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0162)    NETNAME(TPNS0162)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0163)    NETNAME(TPNS0163)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0164)    NETNAME(TPNS0164)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0165)    NETNAME(TPNS0165)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0166)    NETNAME(TPNS0166)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0167)    NETNAME(TPNS0167)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0168)    NETNAME(TPNS0168)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0169)    NETNAME(TPNS0169)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0170)    NETNAME(TPNS0170)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0171)    NETNAME(TPNS0171)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0172)    NETNAME(TPNS0172)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0173)    NETNAME(TPNS0173)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0174)    NETNAME(TPNS0174)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0175)    NETNAME(TPNS0175)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0176)    NETNAME(TPNS0176)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0177)    NETNAME(TPNS0177)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0178)    NETNAME(TPNS0178)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0179)    NETNAME(TPNS0179)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0180)    NETNAME(TPNS0180)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0181)    NETNAME(TPNS0181)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0182)    NETNAME(TPNS0182)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0183)    NETNAME(TPNS0183)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0184)    NETNAME(TPNS0184)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0185)    NETNAME(TPNS0185)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0186)    NETNAME(TPNS0186)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0187)    NETNAME(TPNS0187)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0188)    NETNAME(TPNS0188)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0189)    NETNAME(TPNS0189)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0190)    NETNAME(TPNS0190)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0191)    NETNAME(TPNS0191)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0192)    NETNAME(TPNS0192)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0193)    NETNAME(TPNS0193)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0194)    NETNAME(TPNS0194)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0195)    NETNAME(TPNS0195)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0196)    NETNAME(TPNS0196)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0197)    NETNAME(TPNS0197)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0198)    NETNAME(TPNS0198)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0199)    NETNAME(TPNS0199)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0200)    NETNAME(TPNS0200)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0201)    NETNAME(TPNS0201)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0202)    NETNAME(TPNS0202)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0203)    NETNAME(TPNS0203)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0204)    NETNAME(TPNS0204)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0205)    NETNAME(TPNS0205)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0206)    NETNAME(TPNS0206)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0207)    NETNAME(TPNS0207)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0208)    NETNAME(TPNS0208)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0209)    NETNAME(TPNS0209)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0210)    NETNAME(TPNS0210)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0211)    NETNAME(TPNS0211)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0212)    NETNAME(TPNS0212)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0213)    NETNAME(TPNS0213)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0214)    NETNAME(TPNS0214)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0215)    NETNAME(TPNS0215)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0216)    NETNAME(TPNS0216)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0217)    NETNAME(TPNS0217)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0218)    NETNAME(TPNS0218)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0219)    NETNAME(TPNS0219)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0220)    NETNAME(TPNS0220)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0221)    NETNAME(TPNS0221)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0222)    NETNAME(TPNS0222)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0223)    NETNAME(TPNS0223)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0224)    NETNAME(TPNS0224)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0225)    NETNAME(TPNS0225)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0226)    NETNAME(TPNS0226)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0227)    NETNAME(TPNS0227)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0228)    NETNAME(TPNS0228)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0229)    NETNAME(TPNS0229)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0230)    NETNAME(TPNS0230)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0231)    NETNAME(TPNS0231)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0232)    NETNAME(TPNS0232)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0233)    NETNAME(TPNS0233)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0234)    NETNAME(TPNS0234)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0235)    NETNAME(TPNS0235)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0236)    NETNAME(TPNS0236)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0237)    NETNAME(TPNS0237)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0238)    NETNAME(TPNS0238)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0239)    NETNAME(TPNS0239)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0240)    NETNAME(TPNS0240)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0241)    NETNAME(TPNS0241)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0242)    NETNAME(TPNS0242)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0243)    NETNAME(TPNS0243)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0244)    NETNAME(TPNS0244)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0245)    NETNAME(TPNS0245)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0246)    NETNAME(TPNS0246)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0247)    NETNAME(TPNS0247)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0248)    NETNAME(TPNS0248)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0249)    NETNAME(TPNS0249)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0250)    NETNAME(TPNS0250)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0251)    NETNAME(TPNS0251)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0252)    NETNAME(TPNS0252)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0253)    NETNAME(TPNS0253)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0254)    NETNAME(TPNS0254)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0255)    NETNAME(TPNS0255)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0256)    NETNAME(TPNS0256)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0257)    NETNAME(TPNS0257)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0258)    NETNAME(TPNS0258)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0259)    NETNAME(TPNS0259)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0260)    NETNAME(TPNS0260)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0261)    NETNAME(TPNS0261)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0262)    NETNAME(TPNS0262)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0263)    NETNAME(TPNS0263)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0264)    NETNAME(TPNS0264)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0265)    NETNAME(TPNS0265)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0266)    NETNAME(TPNS0266)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0267)    NETNAME(TPNS0267)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0268)    NETNAME(TPNS0268)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0269)    NETNAME(TPNS0269)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0270)    NETNAME(TPNS0270)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0271)    NETNAME(TPNS0271)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0272)    NETNAME(TPNS0272)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0273)    NETNAME(TPNS0273)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0274)    NETNAME(TPNS0274)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0275)    NETNAME(TPNS0275)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0276)    NETNAME(TPNS0276)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0277)    NETNAME(TPNS0277)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0278)    NETNAME(TPNS0278)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0279)    NETNAME(TPNS0279)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0280)    NETNAME(TPNS0280)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0281)    NETNAME(TPNS0281)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0282)    NETNAME(TPNS0282)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0283)    NETNAME(TPNS0283)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0284)    NETNAME(TPNS0284)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0285)    NETNAME(TPNS0285)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0286)    NETNAME(TPNS0286)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0287)    NETNAME(TPNS0287)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0288)    NETNAME(TPNS0288)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0289)    NETNAME(TPNS0289)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0290)    NETNAME(TPNS0290)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0291)    NETNAME(TPNS0291)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0292)    NETNAME(TPNS0292)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0293)    NETNAME(TPNS0293)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0294)    NETNAME(TPNS0294)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0295)    NETNAME(TPNS0295)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0296)    NETNAME(TPNS0296)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0297)    NETNAME(TPNS0297)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0298)    NETNAME(TPNS0298)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0299)    NETNAME(TPNS0299)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0300)    NETNAME(TPNS0300)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0301)    NETNAME(TPNS0301)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0302)    NETNAME(TPNS0302)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0303)    NETNAME(TPNS0303)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0304)    NETNAME(TPNS0304)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0305)    NETNAME(TPNS0305)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0306)    NETNAME(TPNS0306)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0307)    NETNAME(TPNS0307)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0308)    NETNAME(TPNS0308)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0309)    NETNAME(TPNS0309)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0310)    NETNAME(TPNS0310)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0311)    NETNAME(TPNS0311)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0312)    NETNAME(TPNS0312)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0313)    NETNAME(TPNS0313)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0314)    NETNAME(TPNS0314)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0315)    NETNAME(TPNS0315)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0316)    NETNAME(TPNS0316)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0317)    NETNAME(TPNS0317)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0318)    NETNAME(TPNS0318)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0319)    NETNAME(TPNS0319)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0320)    NETNAME(TPNS0320)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0321)    NETNAME(TPNS0321)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0322)    NETNAME(TPNS0322)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0323)    NETNAME(TPNS0323)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0324)    NETNAME(TPNS0324)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0325)    NETNAME(TPNS0325)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0326)    NETNAME(TPNS0326)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0327)    NETNAME(TPNS0327)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0328)    NETNAME(TPNS0328)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0329)    NETNAME(TPNS0329)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0330)    NETNAME(TPNS0330)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0331)    NETNAME(TPNS0331)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0332)    NETNAME(TPNS0332)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0333)    NETNAME(TPNS0333)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0334)    NETNAME(TPNS0334)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0335)    NETNAME(TPNS0335)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0336)    NETNAME(TPNS0336)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0337)    NETNAME(TPNS0337)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0338)    NETNAME(TPNS0338)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0339)    NETNAME(TPNS0339)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0340)    NETNAME(TPNS0340)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0341)    NETNAME(TPNS0341)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0342)    NETNAME(TPNS0342)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0343)    NETNAME(TPNS0343)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0344)    NETNAME(TPNS0344)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0345)    NETNAME(TPNS0345)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0346)    NETNAME(TPNS0346)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0347)    NETNAME(TPNS0347)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0348)    NETNAME(TPNS0348)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0349)    NETNAME(TPNS0349)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0350)    NETNAME(TPNS0350)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0351)    NETNAME(TPNS0351)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0352)    NETNAME(TPNS0352)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0353)    NETNAME(TPNS0353)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0354)    NETNAME(TPNS0354)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0355)    NETNAME(TPNS0355)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0356)    NETNAME(TPNS0356)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0357)    NETNAME(TPNS0357)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0358)    NETNAME(TPNS0358)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0359)    NETNAME(TPNS0359)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0360)    NETNAME(TPNS0360)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0361)    NETNAME(TPNS0361)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0362)    NETNAME(TPNS0362)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0363)    NETNAME(TPNS0363)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0364)    NETNAME(TPNS0364)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0365)    NETNAME(TPNS0365)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0366)    NETNAME(TPNS0366)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0367)    NETNAME(TPNS0367)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0368)    NETNAME(TPNS0368)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0369)    NETNAME(TPNS0369)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0370)    NETNAME(TPNS0370)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0371)    NETNAME(TPNS0371)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0372)    NETNAME(TPNS0372)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0373)    NETNAME(TPNS0373)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0374)    NETNAME(TPNS0374)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0375)    NETNAME(TPNS0375)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0376)    NETNAME(TPNS0376)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0377)    NETNAME(TPNS0377)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0378)    NETNAME(TPNS0378)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0379)    NETNAME(TPNS0379)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0380)    NETNAME(TPNS0380)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0381)    NETNAME(TPNS0381)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0382)    NETNAME(TPNS0382)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0383)    NETNAME(TPNS0383)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0384)    NETNAME(TPNS0384)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0385)    NETNAME(TPNS0385)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0386)    NETNAME(TPNS0386)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0387)    NETNAME(TPNS0387)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0388)    NETNAME(TPNS0388)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0389)    NETNAME(TPNS0389)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0390)    NETNAME(TPNS0390)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0391)    NETNAME(TPNS0391)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0392)    NETNAME(TPNS0392)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0393)    NETNAME(TPNS0393)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0394)    NETNAME(TPNS0394)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0395)    NETNAME(TPNS0395)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0396)    NETNAME(TPNS0396)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0397)    NETNAME(TPNS0397)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0398)    NETNAME(TPNS0398)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0399)    NETNAME(TPNS0399)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0400)    NETNAME(TPNS0400)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0401)    NETNAME(TPNS0401)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0402)    NETNAME(TPNS0402)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0403)    NETNAME(TPNS0403)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0404)    NETNAME(TPNS0404)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0405)    NETNAME(TPNS0405)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0406)    NETNAME(TPNS0406)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0407)    NETNAME(TPNS0407)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0408)    NETNAME(TPNS0408)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0409)    NETNAME(TPNS0409)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0410)    NETNAME(TPNS0410)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0411)    NETNAME(TPNS0411)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0412)    NETNAME(TPNS0412)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0413)    NETNAME(TPNS0413)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0414)    NETNAME(TPNS0414)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0415)    NETNAME(TPNS0415)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0416)    NETNAME(TPNS0416)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0417)    NETNAME(TPNS0417)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0418)    NETNAME(TPNS0418)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0419)    NETNAME(TPNS0419)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0420)    NETNAME(TPNS0420)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0421)    NETNAME(TPNS0421)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0422)    NETNAME(TPNS0422)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0423)    NETNAME(TPNS0423)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0424)    NETNAME(TPNS0424)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0425)    NETNAME(TPNS0425)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0426)    NETNAME(TPNS0426)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0427)    NETNAME(TPNS0427)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0428)    NETNAME(TPNS0428)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0429)    NETNAME(TPNS0429)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0430)    NETNAME(TPNS0430)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0431)    NETNAME(TPNS0431)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0432)    NETNAME(TPNS0432)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0433)    NETNAME(TPNS0433)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0434)    NETNAME(TPNS0434)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0435)    NETNAME(TPNS0435)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0436)    NETNAME(TPNS0436)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0437)    NETNAME(TPNS0437)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0438)    NETNAME(TPNS0438)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0439)    NETNAME(TPNS0439)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0440)    NETNAME(TPNS0440)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0441)    NETNAME(TPNS0441)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0442)    NETNAME(TPNS0442)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0443)    NETNAME(TPNS0443)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0444)    NETNAME(TPNS0444)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0445)    NETNAME(TPNS0445)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0446)    NETNAME(TPNS0446)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0447)    NETNAME(TPNS0447)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0448)    NETNAME(TPNS0448)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0449)    NETNAME(TPNS0449)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0450)    NETNAME(TPNS0450)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0451)    NETNAME(TPNS0451)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0452)    NETNAME(TPNS0452)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0453)    NETNAME(TPNS0453)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0454)    NETNAME(TPNS0454)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0455)    NETNAME(TPNS0455)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0456)    NETNAME(TPNS0456)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0457)    NETNAME(TPNS0457)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0458)    NETNAME(TPNS0458)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0459)    NETNAME(TPNS0459)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0460)    NETNAME(TPNS0460)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0461)    NETNAME(TPNS0461)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0462)    NETNAME(TPNS0462)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0463)    NETNAME(TPNS0463)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0464)    NETNAME(TPNS0464)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0465)    NETNAME(TPNS0465)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0466)    NETNAME(TPNS0466)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0467)    NETNAME(TPNS0467)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0468)    NETNAME(TPNS0468)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0469)    NETNAME(TPNS0469)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0470)    NETNAME(TPNS0470)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0471)    NETNAME(TPNS0471)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0472)    NETNAME(TPNS0472)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0473)    NETNAME(TPNS0473)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0474)    NETNAME(TPNS0474)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0475)    NETNAME(TPNS0475)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0476)    NETNAME(TPNS0476)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0477)    NETNAME(TPNS0477)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0478)    NETNAME(TPNS0478)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0479)    NETNAME(TPNS0479)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0480)    NETNAME(TPNS0480)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0481)    NETNAME(TPNS0481)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0482)    NETNAME(TPNS0482)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0483)    NETNAME(TPNS0483)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0484)    NETNAME(TPNS0484)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0485)    NETNAME(TPNS0485)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0486)    NETNAME(TPNS0486)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0487)    NETNAME(TPNS0487)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0488)    NETNAME(TPNS0488)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0489)    NETNAME(TPNS0489)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0490)    NETNAME(TPNS0490)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0491)    NETNAME(TPNS0491)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0492)    NETNAME(TPNS0492)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0493)    NETNAME(TPNS0493)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0494)    NETNAME(TPNS0494)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0495)    NETNAME(TPNS0495)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0496)    NETNAME(TPNS0496)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0497)    NETNAME(TPNS0497)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0498)    NETNAME(TPNS0498)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0499)    NETNAME(TPNS0499)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0500)    NETNAME(TPNS0500)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0501)    NETNAME(TPNS0501)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0502)    NETNAME(TPNS0502)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0503)    NETNAME(TPNS0503)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0504)    NETNAME(TPNS0504)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0505)    NETNAME(TPNS0505)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0506)    NETNAME(TPNS0506)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0507)    NETNAME(TPNS0507)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0508)    NETNAME(TPNS0508)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0509)    NETNAME(TPNS0509)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0510)    NETNAME(TPNS0510)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0511)    NETNAME(TPNS0511)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0512)    NETNAME(TPNS0512)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0513)    NETNAME(TPNS0513)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0514)    NETNAME(TPNS0514)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0515)    NETNAME(TPNS0515)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0516)    NETNAME(TPNS0516)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0517)    NETNAME(TPNS0517)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0518)    NETNAME(TPNS0518)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0519)    NETNAME(TPNS0519)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0520)    NETNAME(TPNS0520)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0521)    NETNAME(TPNS0521)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0522)    NETNAME(TPNS0522)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0523)    NETNAME(TPNS0523)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0524)    NETNAME(TPNS0524)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0525)    NETNAME(TPNS0525)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0526)    NETNAME(TPNS0526)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0527)    NETNAME(TPNS0527)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0528)    NETNAME(TPNS0528)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0529)    NETNAME(TPNS0529)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0530)    NETNAME(TPNS0530)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0531)    NETNAME(TPNS0531)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0532)    NETNAME(TPNS0532)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0533)    NETNAME(TPNS0533)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0534)    NETNAME(TPNS0534)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0535)    NETNAME(TPNS0535)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0536)    NETNAME(TPNS0536)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0537)    NETNAME(TPNS0537)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0538)    NETNAME(TPNS0538)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0539)    NETNAME(TPNS0539)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0540)    NETNAME(TPNS0540)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0541)    NETNAME(TPNS0541)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0542)    NETNAME(TPNS0542)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0543)    NETNAME(TPNS0543)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0544)    NETNAME(TPNS0544)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0545)    NETNAME(TPNS0545)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0546)    NETNAME(TPNS0546)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0547)    NETNAME(TPNS0547)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0548)    NETNAME(TPNS0548)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0549)    NETNAME(TPNS0549)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0550)    NETNAME(TPNS0550)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0551)    NETNAME(TPNS0551)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0552)    NETNAME(TPNS0552)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0553)    NETNAME(TPNS0553)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0554)    NETNAME(TPNS0554)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0555)    NETNAME(TPNS0555)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0556)    NETNAME(TPNS0556)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0557)    NETNAME(TPNS0557)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0558)    NETNAME(TPNS0558)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0559)    NETNAME(TPNS0559)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0560)    NETNAME(TPNS0560)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0561)    NETNAME(TPNS0561)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0562)    NETNAME(TPNS0562)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0563)    NETNAME(TPNS0563)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0564)    NETNAME(TPNS0564)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0565)    NETNAME(TPNS0565)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0566)    NETNAME(TPNS0566)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0567)    NETNAME(TPNS0567)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0568)    NETNAME(TPNS0568)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0569)    NETNAME(TPNS0569)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0570)    NETNAME(TPNS0570)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0571)    NETNAME(TPNS0571)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0572)    NETNAME(TPNS0572)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0573)    NETNAME(TPNS0573)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0574)    NETNAME(TPNS0574)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0575)    NETNAME(TPNS0575)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0576)    NETNAME(TPNS0576)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0577)    NETNAME(TPNS0577)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0578)    NETNAME(TPNS0578)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0579)    NETNAME(TPNS0579)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0580)    NETNAME(TPNS0580)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0581)    NETNAME(TPNS0581)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0582)    NETNAME(TPNS0582)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0583)    NETNAME(TPNS0583)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0584)    NETNAME(TPNS0584)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0585)    NETNAME(TPNS0585)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0586)    NETNAME(TPNS0586)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0587)    NETNAME(TPNS0587)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0588)    NETNAME(TPNS0588)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0589)    NETNAME(TPNS0589)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0590)    NETNAME(TPNS0590)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0591)    NETNAME(TPNS0591)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0592)    NETNAME(TPNS0592)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0593)    NETNAME(TPNS0593)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0594)    NETNAME(TPNS0594)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0595)    NETNAME(TPNS0595)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0596)    NETNAME(TPNS0596)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0597)    NETNAME(TPNS0597)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0598)    NETNAME(TPNS0598)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0599)    NETNAME(TPNS0599)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0600)    NETNAME(TPNS0600)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0601)    NETNAME(TPNS0601)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0602)    NETNAME(TPNS0602)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0603)    NETNAME(TPNS0603)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0604)    NETNAME(TPNS0604)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0605)    NETNAME(TPNS0605)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0606)    NETNAME(TPNS0606)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0607)    NETNAME(TPNS0607)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0608)    NETNAME(TPNS0608)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0609)    NETNAME(TPNS0609)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0610)    NETNAME(TPNS0610)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0611)    NETNAME(TPNS0611)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0612)    NETNAME(TPNS0612)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0613)    NETNAME(TPNS0613)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0614)    NETNAME(TPNS0614)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0615)    NETNAME(TPNS0615)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0616)    NETNAME(TPNS0616)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0617)    NETNAME(TPNS0617)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0618)    NETNAME(TPNS0618)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0619)    NETNAME(TPNS0619)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0620)    NETNAME(TPNS0620)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0621)    NETNAME(TPNS0621)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0622)    NETNAME(TPNS0622)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0623)    NETNAME(TPNS0623)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0624)    NETNAME(TPNS0624)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0625)    NETNAME(TPNS0625)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0626)    NETNAME(TPNS0626)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0627)    NETNAME(TPNS0627)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0628)    NETNAME(TPNS0628)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0629)    NETNAME(TPNS0629)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0630)    NETNAME(TPNS0630)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0631)    NETNAME(TPNS0631)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0632)    NETNAME(TPNS0632)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0633)    NETNAME(TPNS0633)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0634)    NETNAME(TPNS0634)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0635)    NETNAME(TPNS0635)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0636)    NETNAME(TPNS0636)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0637)    NETNAME(TPNS0637)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0638)    NETNAME(TPNS0638)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0639)    NETNAME(TPNS0639)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0640)    NETNAME(TPNS0640)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0641)    NETNAME(TPNS0641)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0642)    NETNAME(TPNS0642)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0643)    NETNAME(TPNS0643)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0644)    NETNAME(TPNS0644)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0645)    NETNAME(TPNS0645)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0646)    NETNAME(TPNS0646)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0647)    NETNAME(TPNS0647)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0648)    NETNAME(TPNS0648)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0649)    NETNAME(TPNS0649)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0650)    NETNAME(TPNS0650)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0651)    NETNAME(TPNS0651)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0652)    NETNAME(TPNS0652)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0653)    NETNAME(TPNS0653)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0654)    NETNAME(TPNS0654)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0655)    NETNAME(TPNS0655)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0656)    NETNAME(TPNS0656)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0657)    NETNAME(TPNS0657)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0658)    NETNAME(TPNS0658)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0659)    NETNAME(TPNS0659)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0660)    NETNAME(TPNS0660)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0661)    NETNAME(TPNS0661)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0662)    NETNAME(TPNS0662)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0663)    NETNAME(TPNS0663)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0664)    NETNAME(TPNS0664)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0665)    NETNAME(TPNS0665)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0666)    NETNAME(TPNS0666)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0667)    NETNAME(TPNS0667)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0668)    NETNAME(TPNS0668)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0669)    NETNAME(TPNS0669)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0670)    NETNAME(TPNS0670)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0671)    NETNAME(TPNS0671)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0672)    NETNAME(TPNS0672)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0673)    NETNAME(TPNS0673)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0674)    NETNAME(TPNS0674)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0675)    NETNAME(TPNS0675)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0676)    NETNAME(TPNS0676)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0677)    NETNAME(TPNS0677)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0678)    NETNAME(TPNS0678)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0679)    NETNAME(TPNS0679)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0680)    NETNAME(TPNS0680)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0681)    NETNAME(TPNS0681)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0682)    NETNAME(TPNS0682)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0683)    NETNAME(TPNS0683)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0684)    NETNAME(TPNS0684)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0685)    NETNAME(TPNS0685)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0686)    NETNAME(TPNS0686)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0687)    NETNAME(TPNS0687)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0688)    NETNAME(TPNS0688)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0689)    NETNAME(TPNS0689)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0690)    NETNAME(TPNS0690)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0691)    NETNAME(TPNS0691)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0692)    NETNAME(TPNS0692)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0693)    NETNAME(TPNS0693)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0694)    NETNAME(TPNS0694)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0695)    NETNAME(TPNS0695)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0696)    NETNAME(TPNS0696)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0697)    NETNAME(TPNS0697)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0698)    NETNAME(TPNS0698)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0699)    NETNAME(TPNS0699)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0700)    NETNAME(TPNS0700)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0701)    NETNAME(TPNS0701)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0702)    NETNAME(TPNS0702)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0703)    NETNAME(TPNS0703)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0704)    NETNAME(TPNS0704)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0705)    NETNAME(TPNS0705)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0706)    NETNAME(TPNS0706)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0707)    NETNAME(TPNS0707)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0708)    NETNAME(TPNS0708)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0709)    NETNAME(TPNS0709)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0710)    NETNAME(TPNS0710)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0711)    NETNAME(TPNS0711)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0712)    NETNAME(TPNS0712)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0713)    NETNAME(TPNS0713)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0714)    NETNAME(TPNS0714)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0715)    NETNAME(TPNS0715)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0716)    NETNAME(TPNS0716)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0717)    NETNAME(TPNS0717)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0718)    NETNAME(TPNS0718)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0719)    NETNAME(TPNS0719)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0720)    NETNAME(TPNS0720)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0721)    NETNAME(TPNS0721)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0722)    NETNAME(TPNS0722)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0723)    NETNAME(TPNS0723)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0724)    NETNAME(TPNS0724)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0725)    NETNAME(TPNS0725)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0726)    NETNAME(TPNS0726)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0727)    NETNAME(TPNS0727)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0728)    NETNAME(TPNS0728)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0729)    NETNAME(TPNS0729)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0730)    NETNAME(TPNS0730)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0731)    NETNAME(TPNS0731)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0732)    NETNAME(TPNS0732)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0733)    NETNAME(TPNS0733)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0734)    NETNAME(TPNS0734)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0735)    NETNAME(TPNS0735)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0736)    NETNAME(TPNS0736)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0737)    NETNAME(TPNS0737)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0738)    NETNAME(TPNS0738)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0739)    NETNAME(TPNS0739)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0740)    NETNAME(TPNS0740)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0741)    NETNAME(TPNS0741)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0742)    NETNAME(TPNS0742)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0743)    NETNAME(TPNS0743)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0744)    NETNAME(TPNS0744)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0745)    NETNAME(TPNS0745)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0746)    NETNAME(TPNS0746)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0747)    NETNAME(TPNS0747)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0748)    NETNAME(TPNS0748)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0749)    NETNAME(TPNS0749)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0750)    NETNAME(TPNS0750)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0751)    NETNAME(TPNS0751)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0752)    NETNAME(TPNS0752)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0753)    NETNAME(TPNS0753)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0754)    NETNAME(TPNS0754)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0755)    NETNAME(TPNS0755)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0756)    NETNAME(TPNS0756)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0757)    NETNAME(TPNS0757)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0758)    NETNAME(TPNS0758)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0759)    NETNAME(TPNS0759)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0760)    NETNAME(TPNS0760)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0761)    NETNAME(TPNS0761)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0762)    NETNAME(TPNS0762)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0763)    NETNAME(TPNS0763)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0764)    NETNAME(TPNS0764)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0765)    NETNAME(TPNS0765)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0766)    NETNAME(TPNS0766)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0767)    NETNAME(TPNS0767)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0768)    NETNAME(TPNS0768)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0769)    NETNAME(TPNS0769)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0770)    NETNAME(TPNS0770)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0771)    NETNAME(TPNS0771)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0772)    NETNAME(TPNS0772)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0773)    NETNAME(TPNS0773)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0774)    NETNAME(TPNS0774)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0775)    NETNAME(TPNS0775)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0776)    NETNAME(TPNS0776)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0777)    NETNAME(TPNS0777)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0778)    NETNAME(TPNS0778)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0779)    NETNAME(TPNS0779)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0780)    NETNAME(TPNS0780)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0781)    NETNAME(TPNS0781)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0782)    NETNAME(TPNS0782)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0783)    NETNAME(TPNS0783)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0784)    NETNAME(TPNS0784)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0785)    NETNAME(TPNS0785)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0786)    NETNAME(TPNS0786)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0787)    NETNAME(TPNS0787)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0788)    NETNAME(TPNS0788)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0789)    NETNAME(TPNS0789)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0790)    NETNAME(TPNS0790)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0791)    NETNAME(TPNS0791)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0792)    NETNAME(TPNS0792)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0793)    NETNAME(TPNS0793)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0794)    NETNAME(TPNS0794)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0795)    NETNAME(TPNS0795)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0796)    NETNAME(TPNS0796)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0797)    NETNAME(TPNS0797)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0798)    NETNAME(TPNS0798)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0799)    NETNAME(TPNS0799)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0800)    NETNAME(TPNS0800)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0801)    NETNAME(TPNS0801)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0802)    NETNAME(TPNS0802)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0803)    NETNAME(TPNS0803)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0804)    NETNAME(TPNS0804)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0805)    NETNAME(TPNS0805)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0806)    NETNAME(TPNS0806)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0807)    NETNAME(TPNS0807)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0808)    NETNAME(TPNS0808)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0809)    NETNAME(TPNS0809)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0810)    NETNAME(TPNS0810)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0811)    NETNAME(TPNS0811)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0812)    NETNAME(TPNS0812)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0813)    NETNAME(TPNS0813)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0814)    NETNAME(TPNS0814)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0815)    NETNAME(TPNS0815)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0816)    NETNAME(TPNS0816)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0817)    NETNAME(TPNS0817)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0818)    NETNAME(TPNS0818)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0819)    NETNAME(TPNS0819)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0820)    NETNAME(TPNS0820)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0821)    NETNAME(TPNS0821)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0822)    NETNAME(TPNS0822)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0823)    NETNAME(TPNS0823)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0824)    NETNAME(TPNS0824)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0825)    NETNAME(TPNS0825)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0826)    NETNAME(TPNS0826)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0827)    NETNAME(TPNS0827)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0828)    NETNAME(TPNS0828)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0829)    NETNAME(TPNS0829)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0830)    NETNAME(TPNS0830)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0831)    NETNAME(TPNS0831)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0832)    NETNAME(TPNS0832)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0833)    NETNAME(TPNS0833)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0834)    NETNAME(TPNS0834)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0835)    NETNAME(TPNS0835)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0836)    NETNAME(TPNS0836)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0837)    NETNAME(TPNS0837)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0838)    NETNAME(TPNS0838)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0839)    NETNAME(TPNS0839)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0840)    NETNAME(TPNS0840)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0841)    NETNAME(TPNS0841)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0842)    NETNAME(TPNS0842)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0843)    NETNAME(TPNS0843)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0844)    NETNAME(TPNS0844)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0845)    NETNAME(TPNS0845)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0846)    NETNAME(TPNS0846)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0847)    NETNAME(TPNS0847)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0848)    NETNAME(TPNS0848)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0849)    NETNAME(TPNS0849)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0850)    NETNAME(TPNS0850)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0851)    NETNAME(TPNS0851)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0852)    NETNAME(TPNS0852)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0853)    NETNAME(TPNS0853)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0854)    NETNAME(TPNS0854)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0855)    NETNAME(TPNS0855)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0856)    NETNAME(TPNS0856)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0857)    NETNAME(TPNS0857)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0858)    NETNAME(TPNS0858)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0859)    NETNAME(TPNS0859)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0860)    NETNAME(TPNS0860)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0861)    NETNAME(TPNS0861)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0862)    NETNAME(TPNS0862)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0863)    NETNAME(TPNS0863)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0864)    NETNAME(TPNS0864)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0865)    NETNAME(TPNS0865)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0866)    NETNAME(TPNS0866)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0867)    NETNAME(TPNS0867)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0868)    NETNAME(TPNS0868)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0869)    NETNAME(TPNS0869)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0870)    NETNAME(TPNS0870)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0871)    NETNAME(TPNS0871)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0872)    NETNAME(TPNS0872)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0873)    NETNAME(TPNS0873)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0874)    NETNAME(TPNS0874)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0875)    NETNAME(TPNS0875)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0876)    NETNAME(TPNS0876)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0877)    NETNAME(TPNS0877)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0878)    NETNAME(TPNS0878)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0879)    NETNAME(TPNS0879)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0880)    NETNAME(TPNS0880)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0881)    NETNAME(TPNS0881)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0882)    NETNAME(TPNS0882)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0883)    NETNAME(TPNS0883)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0884)    NETNAME(TPNS0884)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0885)    NETNAME(TPNS0885)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0886)    NETNAME(TPNS0886)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0887)    NETNAME(TPNS0887)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0888)    NETNAME(TPNS0888)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0889)    NETNAME(TPNS0889)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0890)    NETNAME(TPNS0890)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0891)    NETNAME(TPNS0891)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0892)    NETNAME(TPNS0892)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0893)    NETNAME(TPNS0893)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0894)    NETNAME(TPNS0894)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0895)    NETNAME(TPNS0895)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0896)    NETNAME(TPNS0896)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0897)    NETNAME(TPNS0897)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0898)    NETNAME(TPNS0898)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0899)    NETNAME(TPNS0899)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0900)    NETNAME(TPNS0900)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0901)    NETNAME(TPNS0901)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0902)    NETNAME(TPNS0902)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0903)    NETNAME(TPNS0903)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0904)    NETNAME(TPNS0904)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0905)    NETNAME(TPNS0905)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0906)    NETNAME(TPNS0906)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0907)    NETNAME(TPNS0907)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0908)    NETNAME(TPNS0908)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0909)    NETNAME(TPNS0909)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0910)    NETNAME(TPNS0910)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0911)    NETNAME(TPNS0911)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0912)    NETNAME(TPNS0912)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0913)    NETNAME(TPNS0913)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0914)    NETNAME(TPNS0914)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0915)    NETNAME(TPNS0915)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0916)    NETNAME(TPNS0916)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0917)    NETNAME(TPNS0917)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0918)    NETNAME(TPNS0918)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0919)    NETNAME(TPNS0919)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0920)    NETNAME(TPNS0920)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0921)    NETNAME(TPNS0921)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0922)    NETNAME(TPNS0922)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0923)    NETNAME(TPNS0923)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0924)    NETNAME(TPNS0924)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0925)    NETNAME(TPNS0925)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0926)    NETNAME(TPNS0926)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0927)    NETNAME(TPNS0927)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0928)    NETNAME(TPNS0928)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0929)    NETNAME(TPNS0929)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0930)    NETNAME(TPNS0930)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0931)    NETNAME(TPNS0931)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0932)    NETNAME(TPNS0932)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0933)    NETNAME(TPNS0933)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0934)    NETNAME(TPNS0934)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0935)    NETNAME(TPNS0935)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0936)    NETNAME(TPNS0936)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0937)    NETNAME(TPNS0937)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0938)    NETNAME(TPNS0938)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0939)    NETNAME(TPNS0939)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0940)    NETNAME(TPNS0940)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0941)    NETNAME(TPNS0941)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0942)    NETNAME(TPNS0942)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0943)    NETNAME(TPNS0943)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0944)    NETNAME(TPNS0944)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0945)    NETNAME(TPNS0945)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0946)    NETNAME(TPNS0946)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0947)    NETNAME(TPNS0947)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0948)    NETNAME(TPNS0948)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0949)    NETNAME(TPNS0949)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0950)    NETNAME(TPNS0950)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0951)    NETNAME(TPNS0951)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0952)    NETNAME(TPNS0952)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0953)    NETNAME(TPNS0953)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0954)    NETNAME(TPNS0954)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0955)    NETNAME(TPNS0955)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0956)    NETNAME(TPNS0956)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0957)    NETNAME(TPNS0957)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0958)    NETNAME(TPNS0958)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0959)    NETNAME(TPNS0959)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0960)    NETNAME(TPNS0960)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0961)    NETNAME(TPNS0961)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0962)    NETNAME(TPNS0962)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0963)    NETNAME(TPNS0963)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0964)    NETNAME(TPNS0964)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0965)    NETNAME(TPNS0965)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0966)    NETNAME(TPNS0966)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0967)    NETNAME(TPNS0967)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0968)    NETNAME(TPNS0968)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0969)    NETNAME(TPNS0969)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0970)    NETNAME(TPNS0970)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0971)    NETNAME(TPNS0971)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0972)    NETNAME(TPNS0972)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0973)    NETNAME(TPNS0973)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0974)    NETNAME(TPNS0974)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0975)    NETNAME(TPNS0975)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0976)    NETNAME(TPNS0976)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0977)    NETNAME(TPNS0977)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0978)    NETNAME(TPNS0978)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0979)    NETNAME(TPNS0979)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0980)    NETNAME(TPNS0980)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0981)    NETNAME(TPNS0981)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0982)    NETNAME(TPNS0982)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0983)    NETNAME(TPNS0983)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0984)    NETNAME(TPNS0984)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0985)    NETNAME(TPNS0985)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0986)    NETNAME(TPNS0986)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0987)    NETNAME(TPNS0987)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0988)    NETNAME(TPNS0988)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0989)    NETNAME(TPNS0989)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0990)    NETNAME(TPNS0990)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0991)    NETNAME(TPNS0991)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0992)    NETNAME(TPNS0992)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0993)    NETNAME(TPNS0993)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0994)    NETNAME(TPNS0994)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0995)    NETNAME(TPNS0995)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0996)    NETNAME(TPNS0996)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0997)    NETNAME(TPNS0997)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0998)    NETNAME(TPNS0998)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0999)    NETNAME(TPNS0999)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(1000)    NETNAME(TPNS1000)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(C000)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(00)         DESCRIPTION(FIRST MVS CONSOLE ID 0)                  
*                                                                               
DEFINE TERMINAL(C001)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(34)         DESCRIPTION(SECOND MVS CONSOLE ID 1)                 
*                                                                               
DEFINE TERMINAL(C002)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(02)         DESCRIPTION(THIRD MVS CONSOLE ID 2)                  
*                                                                               
DEFINE TERMINAL(C003)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(03)         DESCRIPTION(THIRD MVS CONSOLE ID 2)                  
*                                                                               
DEFINE TERMINAL(C004)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(04)         DESCRIPTION(SECOND MVS CONSOLE ID 1)                 
*                                                                               
DEFINE TERMINAL(C005)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(05)         DESCRIPTION(THIRD MVS CONSOLE ID 2)                  
*                                                                               
DEFINE TERMINAL(C006)      GROUP(CRTS)          TYPETERM(DFHCONS)               
       CONSOLE(06)         DESCRIPTION(THIRD MVS CONSOLE ID 2)                  
*                                                                               
*                                                                               
                                                                                
*                                                                               
*                                                                               
*                                                                               
DEFINE PROGRAM(CIFORMAT)   GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(CFMT) PROGRAM(CIFORMAT) GROUP(DB2GRP)                        
DEFINE PROGRAM(CI2Q101)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q101) PROGRAM(CI2Q101) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q102)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q102) PROGRAM(CI2Q102) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q103)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q103) PROGRAM(CI2Q103) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q104)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q104) PROGRAM(CI2Q104) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q105)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q105) PROGRAM(CI2Q105) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q106)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q106) PROGRAM(CI2Q106) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q107)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q107) PROGRAM(CI2Q107) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q108)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q108) PROGRAM(CI2Q108) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q109)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q109) PROGRAM(CI2Q109) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q110)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q110) PROGRAM(CI2Q110) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q201)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q201) PROGRAM(CI2Q201) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q202)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q202) PROGRAM(CI2Q202) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q203)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q203) PROGRAM(CI2Q203) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q204)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q204) PROGRAM(CI2Q204) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q205)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q205) PROGRAM(CI2Q205) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q206)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q206) PROGRAM(CI2Q206) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q207)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q207) PROGRAM(CI2Q207) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q208)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q208) PROGRAM(CI2Q208) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q209)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q209) PROGRAM(CI2Q209) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q210)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q210) PROGRAM(CI2Q210) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q211)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q211) PROGRAM(CI2Q211) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q212)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q212) PROGRAM(CI2Q212) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q213)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q213) PROGRAM(CI2Q213) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q214)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q214) PROGRAM(CI2Q214) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q215)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q215) PROGRAM(CI2Q215) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q216)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q216) PROGRAM(CI2Q216) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q217)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q217) PROGRAM(CI2Q217) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q218)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q218) PROGRAM(CI2Q218) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q301)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q301) PROGRAM(CI2Q301) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q302)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q302) PROGRAM(CI2Q302) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q303)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q303) PROGRAM(CI2Q303) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q304)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q304) PROGRAM(CI2Q304) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q305)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q305) PROGRAM(CI2Q305) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q306)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q306) PROGRAM(CI2Q306) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q307)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q307) PROGRAM(CI2Q307) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q308)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q308) PROGRAM(CI2Q308) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q309)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q309) PROGRAM(CI2Q309) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q310)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q310) PROGRAM(CI2Q310) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q311)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q311) PROGRAM(CI2Q311) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q312)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q312) PROGRAM(CI2Q312) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q313)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q313) PROGRAM(CI2Q313) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q314)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q314) PROGRAM(CI2Q314) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q315)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q315) PROGRAM(CI2Q315) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q316)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q316) PROGRAM(CI2Q316) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q401)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q401) PROGRAM(CI2Q401) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q402)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q402) PROGRAM(CI2Q402) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q403)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q403) PROGRAM(CI2Q403) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q404)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q404) PROGRAM(CI2Q404) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q405)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q405) PROGRAM(CI2Q405) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q406)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q406) PROGRAM(CI2Q406) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q407)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q407) PROGRAM(CI2Q407) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q408)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q408) PROGRAM(CI2Q408) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q409)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q409) PROGRAM(CI2Q409) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q410)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q410) PROGRAM(CI2Q410) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q411)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q411) PROGRAM(CI2Q411) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q412)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q412) PROGRAM(CI2Q412) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q413)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q413) PROGRAM(CI2Q413) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q414)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q414) PROGRAM(CI2Q414) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q501)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q501) PROGRAM(CI2Q501) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q502)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q502) PROGRAM(CI2Q502) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q503)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q503) PROGRAM(CI2Q503) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q601)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q601) PROGRAM(CI2Q601) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q602)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q602) PROGRAM(CI2Q602) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q603)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q603) PROGRAM(CI2Q603) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q604)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q604) PROGRAM(CI2Q604) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q605)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q605) PROGRAM(CI2Q605) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q606)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q606) PROGRAM(CI2Q606) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q607)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q607) PROGRAM(CI2Q607) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q608)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q608) PROGRAM(CI2Q608) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q609)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q609) PROGRAM(CI2Q609) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2Q610)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(Q610) PROGRAM(CI2Q610) GROUP(DB2GRP)                         
*                                                                               
DEFINE CONNECTION(TA01)                                                         
       GROUP(MROTA01)                                                           
       PROTOCOL(APPC)                                                           
       ACCESSMETHOD(VTAM)                                                       
       NETNAME(DICS)                                                            
       SINGLESESS(N)                                                            
       INSERVICE(YES)                                                           
       AUTOCONNECT(YES)                                                         
DEFINE SESSIONS(T001A001)                                                       
       GROUP(MROTA01)                                                           
       CONNECTION(TA01)                                                         
       PROTOCOL(APPC)                                                           
       MAXIMUM(300,0)                                                           
       AUTOCONNECT(YES)                                                         
       SENDSIZE(1536)                                                           
       RECEIVESIZE(256)                                                         
DEFINE CONNECTION(TXXX)                                                         
       GROUP(MROTA01)                                                           
       ACCESSMETHOD(IRC)                                                        
       NETNAME(DXXX)                                                            
       INSERVICE(NO)                                                            
DEFINE SESSIONS(T001AXXX)                                                       
       GROUP(MROTA01)                                                           
       CONNECTION(TXXX)                                                         
       PROTOCOL(LU61)                                                           
       RECEIVEPFX(AR)                                                           
       RECEIVECOUNT(1)                                                          
       SENDPFX(AS)                                                              
       SENDCOUNT(1)                                                             
DEFINE TRANSACTION(I001) PROGRAM(DFHCP001) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I002) PROGRAM(DFHCP002) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I003) PROGRAM(DFHCP003) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I004) PROGRAM(DFHCP004) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I005) PROGRAM(DFHCP005) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I006) PROGRAM(DFHCP006) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I007) PROGRAM(DFHCP007) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I008) PROGRAM(DFHCP008) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I009) PROGRAM(DFHCP009) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I010) PROGRAM(DFHCP010) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I011) PROGRAM(DFHCP011) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I012) PROGRAM(DFHCP012) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I013) PROGRAM(DFHCP013) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I014) PROGRAM(DFHCP014) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I015) PROGRAM(DFHCP015) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I016) PROGRAM(DFHCP016) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I017) PROGRAM(DFHCP017) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I018) PROGRAM(DFHCP018) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I019) PROGRAM(DFHCP019) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(I020) PROGRAM(DFHCP020) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U001) PROGRAM(DFHCP001) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U002) PROGRAM(DFHCP002) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U003) PROGRAM(DFHCP003) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U004) PROGRAM(DFHCP004) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U005) PROGRAM(DFHCP005) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U006) PROGRAM(DFHCP006) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U007) PROGRAM(DFHCP007) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U008) PROGRAM(DFHCP008) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U009) PROGRAM(DFHCP009) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U010) PROGRAM(DFHCP010) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U011) PROGRAM(DFHCP011) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U012) PROGRAM(DFHCP012) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U013) PROGRAM(DFHCP013) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U014) PROGRAM(DFHCP014) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U015) PROGRAM(DFHCP015) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U016) PROGRAM(DFHCP016) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U017) PROGRAM(DFHCP017) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U018) PROGRAM(DFHCP018) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U019) PROGRAM(DFHCP019) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(U020) PROGRAM(DFHCP020) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R001) PROGRAM(DFHRP001) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R002) PROGRAM(DFHRP002) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R003) PROGRAM(DFHRP003) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R004) PROGRAM(DFHRP004) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R005) PROGRAM(DFHRP005) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R006) PROGRAM(DFHRP006) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R007) PROGRAM(DFHRP007) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R008) PROGRAM(DFHRP008) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R009) PROGRAM(DFHRP009) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R010) PROGRAM(DFHRP010) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R011) PROGRAM(DFHRP011) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R012) PROGRAM(DFHRP012) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R013) PROGRAM(DFHRP013) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R014) PROGRAM(DFHRP014) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R015) PROGRAM(DFHRP015) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R016) PROGRAM(DFHRP016) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R017) PROGRAM(DFHRP017) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R018) PROGRAM(DFHRP018) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R019) PROGRAM(DFHRP019) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(R020) PROGRAM(DFHRP020) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE TRANSACTION(AMNU) PROGRAM(DFH$AMNU) GROUP(MROTA01)                       
       DYNAMIC(NO) REMOTESYSTEM(TA01)                                           
DEFINE FILE(FILEA001) DSNAME(DICS321.CICS.FILEA001) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA002) DSNAME(DICS321.CICS.FILEA002) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA003) DSNAME(DICS321.CICS.FILEA003) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA004) DSNAME(DICS321.CICS.FILEA004) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA005) DSNAME(DICS321.CICS.FILEA005) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA006) DSNAME(DICS321.CICS.FILEA006) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA007) DSNAME(DICS321.CICS.FILEA007) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA008) DSNAME(DICS321.CICS.FILEA008) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA009) DSNAME(DICS321.CICS.FILEA009) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA010) DSNAME(DICS321.CICS.FILEA010) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA011) DSNAME(DICS321.CICS.FILEA011) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA012) DSNAME(DICS321.CICS.FILEA012) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA013) DSNAME(DICS321.CICS.FILEA013) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA014) DSNAME(DICS321.CICS.FILEA014) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA015) DSNAME(DICS321.CICS.FILEA015) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA016) DSNAME(DICS321.CICS.FILEA016) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA017) DSNAME(DICS321.CICS.FILEA017) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA018) DSNAME(DICS321.CICS.FILEA018) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA019) DSNAME(DICS321.CICS.FILEA019) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
DEFINE FILE(FILEA020) DSNAME(DICS321.CICS.FILEA020) STRINGS(20)                 
       GROUP(MROTA01) UPDATE(YES) BROWSE(YES) LSRPOOLID(1)                      
       INDEXBUFFERS(5) DATABUFFERS(5) REMOTESYSTEM(TA01)                        
       RECOVERY(ALL) FWDRECOVLOG(1)                                             
*                                                                               
DEFINE PROGRAM(IGZCPCC)    GROUP(COB2GRP)     LANGUAGE(ASSEMBLER)               
*                                                                               
DEFINE PROGRAM(IGZCPAC)    GROUP(COB2GRP)     LANGUAGE(ASSEMBLER)               
*                                                                               
DEFINE PROFILE(OUTBCHN)    GROUP(DB2GRP)     CHAINCONTROL(YES)                  
*                                                                               
APPEND LIST(DFHLIST) TO (TLIST)                                                 
*                                                                               
ADD GROUP(CRTS) LIST(TLIST)                                                     
*                                                                               
ADD GROUP(DFH$ACCT) LIST(TLIST)                                                 
*                                                                               
ADD GROUP(DB2GRP) LIST(TLIST)                                                   
*                                                                               
ADD GROUP(MROTA01) LIST(TLIST)                                                  
*                                                                               
ADD GROUP(COB2GRP) LIST(TLIST)                                                  
*                                                                               
LIST LIST(TLIST) OBJECTS                                                        
/*                                                                              
//                                                                              
