//DFDSSCPY JOB (D3330RWM,ROOM),'D J YOUNG',MSGCLASS=O                           
//S1      EXEC PGM=ADRDSSU,REGION=4096K                                         
//**********************************************************************        
//****************   USE DF/DSS TO BACKUP        ***********************        
//****************   DATABASE VOLUME             ***********************        
//**********************************************************************        
//DASD1 DD DISP=SHR,UNIT=3390,VOL=SER=LLM001                                    
//TAPE1 DD UNIT=EE8,DISP=(,KEEP),DSN=DSS.BACKUP.LLM001                          
//*  VOL=SER=(001878,001872)                                                    
//SYSPRINT DD SYSOUT=*                                                          
 DUMP DATASET(INCLUDE(CDN.**,VION.**)) -                                        
                               LOGINDDNAME(DASD1) OUTDDNAME(TAPE1)              
//*                                                                             
