//DFHRCT   JOB   0,YOUNG,MSGLEVEL=(1,1),                                00001000
//         MSGCLASS=O                                                   00002000
//*RCT      EXEC DFHAUPLK,COND=(4,LT)                                   01150000
//*ASSEM.SYSUT1 DD DISP=SHR,                                            01160000
//*        DSN=DSN22X.DSNSAMP(DSN8FRCT)                                 01170000
//*                                                                     01180000
