//SMFDUMP  JOB (RWM,T),'DUMP',MSGCLASS=O                                00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPOUT DD DISP=MOD,DSN=MV43RS.JUL12953.SMFDATA,                      00014032
//    VOL=SER=MV43RS,UNIT=3390                                          00015032
//DUMPIN  DD DSN=SYS1.MANA,DISP=SHR                                     00016032
