//DUMPSMFT JOB (RWM,T),'DUMP',MSGCLASS=O                                00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPOUT DD DISP=(,DELETE),DSN=&&TEMP,UNIT=3390,                       00014000
//    VOL=SER=CICS32,SPACE=(CYL,(50,50))                                00015000
//DUMPIN DD DISP=OLD,DSN=SWBTSTL.SMF,UNIT=3390,VOL=SER=CICS32           00016001
