//DUMPSMF  JOB (RWM,T),'DUMP',MSGCLASS=O                                00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPIN DD DISP=SHR,DSN=DB2310.FEB15941.SMFDATA,                       00014000
//    VOL=SER=DB2310,UNIT=3390                                          00015000
//DUMPOUT DD DISP=(NEW,KEEP),DSN=DB2310.FEB15942.SMFDATA,               00015100
//    VOL=SER=DB2310,UNIT=3390,SPACE=(CYL,(50,50))                      00015200
