//DUMPSMF  JOB (RWM,T),'DUMP',MSGCLASS=O                                00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPOUT DD DISP=MOD,DSN=DB25CE.AUG19938.SMFDATA,                      00014006
//    VOL=SER=DB25CE,UNIT=3390                                          00015000
//DUMPIN DD DISP=OLD,DSN=SYS1.MAN2                                      00016006
