//IMSSVC  JOB (D3330RWM,ROOM),'D J YOUNG',MSGCLASS=O                            
//S1      EXEC ASMFCL                                                           
//ASM.SYSIN DD *                                                                
IEANC203 NMLDEF NUCL=IGC203                                                     
//LKED.SYSLMOD DD DSN=SYS1.NUCLEUS,DISP=SHR                                     
//LKED.SYSIN DD *                                                               
   NAME IEANC203                                                                
/*                                                                              
//                                                                              
