//LOADDB24 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='057500001,060000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB24',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB25 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='060000001,062500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB25',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB26 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='062500001,065000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB26',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB27 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='065000001,067500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB27',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB28 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='067500001,070000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB28',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB29 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='070000001,072500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB29',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB30 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='072500001,075000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB30',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB31 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='075000001,077500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB31',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB32 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='077500001,080000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB32',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB33 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='080000001,082500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB33',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB34 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='082500001,085000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB34',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB35 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='085000001,087500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB35',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB36 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='087500001,090000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB36',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB37 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='090000001,092500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB37',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB38 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='092500001,095000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB38',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB39 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='095000001,097500000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB39',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
//LOADDB40 JOB (AAA),'D J YOUNG',MSGCLASS=X,TIME=1440,USER=DAVID,               
//         REGION=0K                                                            
//DOIT EXEC PGM=RANDCOBL,PARM='097500001,100000000,100000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR                                                 00180003
//OUTPUT   DD  DSN=DAVID.P2.DATA,DISP=(,KEEP),UNIT=SYSDA,               00190005
//    DCB=(BLKSIZE=27800,RECFM=FB),VOL=SER=VOLC01,SPACE=(CYL,(400,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
//DSNUPROC PROC LIB='SYS1.DSNLOAD',                                             
//         SYSTEM=DSN,                                                          
//         SIZE=1024K,UID='',UTPROC=''                                          
//*        SIZE=1024K,UID='',UTPROC='RESTART'                                   
//DSNUPROC EXEC PGM=DSNUTILB,REGION=&SIZE,                                      
//         PARM=(&SYSTEM,'&UID','&UTPROC')                                      
//STEPLIB  DD DSN=&LIB,DISP=SHR                                                 
//SYSPRINT DD SYSOUT=*                                                          
//UTPRINT  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//    PEND                                                                      
//UTIL EXEC DSNUPROC,SYSTEM=DSN,UID='LODB40',UTPROC=''                          
//*                                                                             
//**********************************************                                
//*                                                                             
//*  GENERATING JCL FOR THE LOAD UTILITY                                        
//*  DATE:  11/04/87          TIME:  05:03:15                                   
//*                                                                             
//**********************************************                                
//*                                                                             
//DSNUPROC.SORTWK01 DD DSN=&&SORT1,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC02                                                
//DSNUPROC.SORTWK02 DD DSN=&&SORT2,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC03                                                
//DSNUPROC.SORTWK03 DD DSN=&&SORT3,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLC04                                                
//DSNUPROC.SORTWK04 DD DSN=&&SORT4,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(500,100),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA0                                                
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,                                              
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA1                                                
//DSNUPROC.SORTOUT DD DSN=&&SORTOT,                                             
//     DISP=(,DELETE),DCB=BLKSIZE=15400,                                        
//     SPACE=(CYL,(1000,50),,,ROUND),                                           
//     UNIT=SYSDA,VOL=SER=VOLBA2                                                
//DSNUPROC.MYDD1 DD DSN=DAVID.P2.DATA,UNIT=SYSDA,DISP=(OLD,DELETE),             
//  VOL=SER=VOLC01                                                              
//DSNUPROC.SYSMAP DD  DSN=&&SYSMAP,UNIT=SYSDA,DISP=(NEW,DELETE,DELETE),         
// SPACE=(CYL,(50,50)),DCB=BLKSIZE=15400,VOL=SER=VOLBA3                         
//DSNUPROC.SYSIN    DD  *                                                       
 LOAD DATA INDDN(MYDD1) LOG NO RESUME YES                               00010000
      INTO TABLE DAVID.SQ100                                            00020000
     (KSEQ  POSITION(1:4) INTEGER,                                              
      K500K POSITION(5:8)     INTEGER,                                          
      K250K POSITION(9:12)    INTEGER,                                          
      K100K POSITION(13:16)   INTEGER,                                          
      K40K  POSITION(17:20)   INTEGER,                                          
      K10K  POSITION(21:24)   INTEGER,                                          
      K1K   POSITION(25:28)   INTEGER,                                          
      K100  POSITION(29:32)   INTEGER,                                          
      K25   POSITION(33:36)   INTEGER,                                          
      K10   POSITION(37:40)   INTEGER,                                          
      K5    POSITION(41:44)   INTEGER,                                          
      K4    POSITION(45:48)   INTEGER,                                          
      K2    POSITION(49:52)   INTEGER,                                          
      SORTBIN  POSITION(53:56)   INTEGER,                                       
      SORTPACK POSITION(57:60)   DEC PACKED,                                    
      SORTCHAR POSITION(61:68)   CHAR(8),                                       
      S4       POSITION(69:98)   CHAR(30),                                      
      S5       POSITION(99:128)  CHAR(30),                                      
      S6       POSITION(129:158) CHAR(30),                                      
      S7       POSITION(159:178) CHAR(20),                                      
      S8       POSITION(179:200) CHAR(22))                                      
