//RANDGEN  JOB (330DJY00),'D J YOUNG ',MSGCLASS=O,NOTIFY=DAVID          00001008
//DOIT EXEC PGM=COBRAND4,PARM='000000001,000010000,000010000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR,UNIT=3390,VOL=SER=DB2IMS                        00180003
//OUTPUT   DD  DSN=DAVID.X4.DATA,DISP=(,KEEP),UNIT=3390,                00190005
//    DCB=(BLKSIZE=10210,RECFM=FB),VOL=SER=MV43CA,SPACE=(CYL,(100,50))  00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
