//RANDGEN  JOB (330DJY00),'D J YOUNG ',MSGCLASS=O,NOTIFY=DAVID          00001008
//DOIT EXEC PGM=RANDCOBL,PARM='000000001,004000000,004000000'           00170005
//STEPLIB  DD  DSNAME=DAVID.DB2SMF.PGMLIB,                              00170005
//             DISP=SHR,UNIT=3390,VOL=SER=DB2IMS                        00180003
//OUTPUT   DD  DSN=DAVID.M4.DATA,DISP=(,KEEP),UNIT=3390,                00190005
//    DCB=(BLKSIZE=24000,RECFM=FB),VOL=SER=MV51RS,SPACE=(CYL,(900,100)) 00190005
//SYSUDUMP DD  SYSOUT=*                                                 00190005
//SYSABOUT DD  SYSOUT=*                                                 00190005
