//SETCAOFF JOB (330DJY00),'D J YOUNG ',MSGCLASS=X,NOTIFY=DAVID          00010000
//SETCAC  EXEC PGM=IDCAMS                                               00020000
//SYSPRINT DD  SYSOUT=*                                                 00030000
//SYSUDUMP DD  SYSOUT=*                                                 00040000
//SETD0    DD  UNIT=3390,DISP=OLD,VOL=SER=DB2I01                        00052502
//SYSIN    DD  *                                                        00054100
   SETCACHE -                                                           00054200
         VOLUME (DB2I01) UNIT(3390) SUBSYSTEM OFF                       00054302
