//SMFDUMP2 JOB (RWM,T),'DUMP',MSGCLASS=O                                00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPOUT DD DISP=(NEW,KEEP),DSN=DB2D12.EDS.SMFDATA,                    00014000
//    VOL=SER=DB2D12,UNIT=3390,SPACE=(CYL,(50,50))                      00015000
//DUMPIN  DD DSN=DGSRRB.SMF.HDS,DISP=SHR,UNIT=CTAPE,                    00016000
//        VOL=SER=M13996,LABEL=(1,SL)                                   00017000
