//IDCAMS JOB 12345,CHI,CLASS=A,MSGCLASS=X                               00010000
//IDCAMS EXEC PGM=IDCAMS                                                00020000
//SYSPRINT DD SYSOUT=*                                                  00030000
//DD1 DD DSN=BM1,UNIT=EE1,VOL=SER=002603,DISP=OLD,LABEL=(1,BLP),        00031000
//    DCB=(RECFM=U,BLKSIZE=32000)                                       00031100
//SYSIN    DD *                                                         00040000
 PRINT IFILE(DD1) COUNT(3)                                              00053000
 PRINT IFILE(DD2) COUNT(3)                                              00054000
